[
    {
        "File Name": "bathroom_minimalist_28.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_28.jpg",
        "Style": "minimalist",
        "Generated Title": "Earthy Minimalist Oasis: Soothing Stone and Warm LED Glow",
        "Generated Description": "This modern minimalist bathroom exudes a serene, spa-like ambiance with its organic design. Walls and floors are clad in a textured, light beige or greige plaster/concrete finish, complemented by a freestanding, matte stone-like bathtub and a rustic floating wooden vanity. Warm, indirect LED strip lighting from ceiling coves, along with subtle recessed spotlights, bathes the space in a soft glow, highlighting the earthy color palette and sleek matte black fixtures.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_28.jpg"
    },
    {
        "File Name": "bathroom_minimalist_85.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_85.jpg",
        "Style": "minimalist",
        "Generated Title": "Sleek Bathroom with Sculptural Mirror and Soft Illumination",
        "Generated Description": "This modern minimalist bathroom showcases a floating double vanity crafted from light beige stone or composite material, featuring sleek matte black faucets and a striking, irregularly shaped mirror with a thin black frame against a subtly textured neutral wall. Indirect LED strip lighting emanates a warm, serene glow from behind the mirror and beneath the vanity, complemented by discreet ceiling spotlights, illuminating a light wooden shelf adorned with natural woven baskets and neatly folded white towels. The design embraces a calming palette of creams, beiges, and subtle black accents, creating a clean, spa-like atmosphere.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_85.jpg"
    },
    {
        "File Name": "bathroom_minimalist_3.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_3.jpg",
        "Style": "minimalist",
        "Generated Title": "Serene Japanese-Inspired Bathroom with Natural Hues",
        "Generated Description": "This modern Japanese-inspired bathroom features a serene, minimalist design dominated by light-toned wood on the floating vanity, ceiling accents, and slatted shower mat. The natural palette includes off-white walls, a warm beige vessel sink, black metal fixtures, and a touch of organic green from a large potted plant. Ambient cove lighting softly illuminates the space, which includes a glass-enclosed shower, a wall-hung toilet, and delicate pebble flooring, creating a tranquil, spa-like sanctuary.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_3.jpg"
    },
    {
        "File Name": "bathroom_minimalist_19.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_19.jpg",
        "Style": "minimalist",
        "Generated Title": "Serene Japandi Bathroom: Wood, Marble, and Greenery",
        "Generated Description": "This modern Japandi-style bathroom exudes a serene and sophisticated ambiance, masterfully blending natural materials. Warm wood paneling and flooring are complemented by a striking fluted marble vanity with a smooth white countertop and integrated sink, alongside black metal accents for the mirror, faucet, and overhead spotlight. A large tropical plant, partially obscured by a ribbed glass partition, adds a vibrant touch of greenery and life, enhancing the minimalist, spa-like design bathed in natural light from the large window.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_19.jpg"
    },
    {
        "File Name": "bathroom_minimalist_9.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_9.jpg",
        "Style": "minimalist",
        "Generated Title": "Modern Minimalist Powder Room with Wood Slats and Black Accents",
        "Generated Description": "This modern minimalist powder room showcases a sophisticated blend of natural materials and sleek design. A striking vertical wood slat accent wall provides warmth and texture, beautifully contrasted by crisp white walls and matte black fixtures, including the organic-shaped mirror, sleek faucet, and minimalist wall sconces. Warm, directional up-and-down lights enhance the inviting atmosphere, highlighting the clean lines of the floating wood vanity, white vessel sink, and wall-mounted toilet, creating an elegant and functional space with a contemporary aesthetic.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_9.jpg"
    },
    {
        "File Name": "bathroom_minimalist_83.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_83.jpg",
        "Style": "minimalist",
        "Generated Title": "Serene Contemporary Bathroom: Wood, Stone, and Warm Light",
        "Generated Description": "This modern minimalist bathroom features a sophisticated design, utilizing a harmonious palette of natural materials including light-toned wood paneling and cabinetry, alongside creamy off-white walls and flooring. Warm recessed ceiling spotlights and subtle integrated LED strip lighting create an inviting ambiance, highlighting the clean lines and textures throughout the space. Elegant bronze and brass fixtures complement the design, adding a touch of understated luxury to the spacious walk-in shower and freestanding bathtub.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_83.jpg"
    },
    {
        "File Name": "bathroom_minimalist_129.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_129.jpg",
        "Style": "minimalist",
        "Generated Title": "Warm Wood and Stone: A Modern Bathroom Retreat",
        "Generated Description": "This modern and minimalist bathroom features a tranquil design centered around natural materials and warm, neutral colors. It showcases slatted wood on both the ceiling and a wall panel, complemented by various shades of beige and greige concrete-look walls and floor tiles, along with a floating wooden vanity topped with two light grey vessel sinks. Multiple lighting elements, including recessed ceiling spotlights, delicate pendant lights, and a backlit circular mirror, create a layered and inviting ambiance, while dark bronze fixtures and a clear glass shower partition add contemporary touches to this spa-like retreat.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_129.jpg"
    },
    {
        "File Name": "bathroom_minimalist_100.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_100.jpg",
        "Style": "minimalist",
        "Generated Title": "Modern Wood & Stone Bathroom with Spa-Like Serenity",
        "Generated Description": "This inviting modern bathroom features a serene, spa-like design, characterized by abundant warm-toned wood planks adorning the ceiling and a feature wall, beautifully contrasted with light gray tiled walls and a sleek concrete-like vanity top. Bright recessed LED spotlights in the ceiling cast a clean glow, illuminating the frameless glass shower and the floating wooden vanity. The overall aesthetic combines natural wood hues with cool grays and crisp whites, creating a clean, minimalist, and warmly sophisticated space.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_100.jpg"
    },
    {
        "File Name": "bathroom_minimalist_102.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_102.jpg",
        "Style": "minimalist",
        "Generated Title": "Sleek Minimalist Bathroom: Cream Tiles, Matte Black Accents",
        "Generated Description": "This modern minimalist bathroom exudes a serene aesthetic, featuring light beige large-format tiles on both walls and floor, creating a cohesive backdrop. Crisp white floating cabinetry and toilet are contrasted by sleek matte black fixtures, including the showerhead, faucet, and the slim frame of the glass shower partition, adding a bold contemporary touch. Illumination is provided by recessed ceiling spotlights, a linear LED strip above the mirror, and subtle under-vanity lighting, enhancing the clean lines and functional, uncluttered design.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_102.jpg"
    },
    {
        "File Name": "bathroom_minimalist_25.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_25.jpg",
        "Style": "minimalist",
        "Generated Title": "Serene Minimalist Bathroom Oasis",
        "Generated Description": "This contemporary and minimalist bathroom features a calming neutral palette of warm greys, beiges, and natural light wood, creating a serene, spa-like ambiance. The design incorporates a floating vanity with ribbed wood paneling, textured plaster walls, and a light stone countertop, all complemented by sleek matte black fixtures and a rounded black-framed mirror; recessed ceiling spotlights and subtle LED strip lighting in the shower niche illuminate the space, highlighting its clean lines and rich material contrasts.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_25.jpg"
    },
    {
        "File Name": "bathroom_minimalist_114.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_114.jpg",
        "Style": "minimalist",
        "Generated Title": "Contemporary Spa-Like Bathroom: Concrete, Wood, and Light",
        "Generated Description": "This modern minimalist bathroom features a sophisticated blend of industrial concrete finishes for the walls and floor, contrasted with the warmth of dark floating wood cabinetry. The lighting design is a key element, incorporating perimeter LED strip lighting in the ceiling, a striking backlit circular mirror, and subtle under-vanity illumination, complemented by natural light from a rectangular window. The cool gray tones and clean lines create a serene, spa-like atmosphere, enhanced by white ceramic fixtures and a sleek glass shower partition, embodying contemporary design.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_114.jpg"
    },
    {
        "File Name": "bathroom_minimalist_105.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_105.jpg",
        "Style": "minimalist",
        "Generated Title": "Sleek Wood-Paneled Toilet with Integrated Storage",
        "Generated Description": "This modern and minimalist bathroom features a wall-mounted toilet encased in rich, warm-toned wood paneling, complemented by dark grey textured walls and a light grey floor. Integrated LED strip lighting provides an ambient glow above a neatly organized shelf holding white towels and a small plant, while a clever vertical storage unit with dark shelves offers discreet organization for toiletries, emphasizing clean lines, natural materials, and efficient space utilization with an elegant palette of browns, greys, and whites.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_105.jpg"
    },
    {
        "File Name": "bathroom_minimalist_24.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_24.jpg",
        "Style": "minimalist",
        "Generated Title": "Tranquil Modern Bathroom with Wavy Wall and Backlit Mirror",
        "Generated Description": "This serene modern bathroom showcases a harmonious blend of natural materials and sophisticated lighting. A striking wavy, textured wall in a light cream color forms the backdrop, beautifully illuminated by hidden strip lights from above and below, complementing the oval backlit mirror. The minimalist design features a floating light wood vanity with a white vessel sink and a wall-mounted toilet, while warm wood tones on the vanity and floor, along with subtle black accents and soft, indirect lighting from the mirror and under the vanity, create a peaceful, spa-like atmosphere.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_24.jpg"
    },
    {
        "File Name": "bathroom_minimalist_18.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_18.jpg",
        "Style": "minimalist",
        "Generated Title": "Sleek Greige Bathroom: Modern Design with Warm Lighting",
        "Generated Description": "This modern, minimalist bathroom showcases a sophisticated palette, featuring large-format light greige tiles with subtle veining across the shower walls and floor, complemented by smooth matte gray paneling behind the wall-mounted toilet. Matte black fixtures and accessories provide a striking, contemporary contrast, while warm ambient lighting from a recessed ceiling spot and a prominent LED strip along the shower's edge enhances the luxurious and serene atmosphere. The overall design emphasizes clean lines, functionality, and an uncluttered aesthetic, creating an inviting and chic space.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_18.jpg"
    },
    {
        "File Name": "bathroom_minimalist_124.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_124.jpg",
        "Style": "minimalist",
        "Generated Title": "Organic Modern Bathroom with Earthy Tones and Ambient Light",
        "Generated Description": "This modern and minimalist bathroom features a serene design centered on natural materials and warm, ambient lighting. Textured stone tiles in warm grey and beige define the walls, contrasting with a dark fluted wood floating vanity, a light stone bowl sink, and a cylindrical base. An irregularly shaped mirror with a warm LED backlight and two spherical, glowing wall sconces illuminate the space, completing the elegant, earthy aesthetic that combines organic forms with sophisticated textures.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_124.jpg"
    },
    {
        "File Name": "bathroom_minimalist_7.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_7.jpg",
        "Style": "minimalist",
        "Generated Title": "Tranquil Japandi Bath with Wood and Stone",
        "Generated Description": "This tranquil bathroom embodies a Japandi-inspired minimalist design, featuring a warm, neutral palette of light beige stone-look tiles on the walls and floor. A substantial natural wooden vanity supports a simple stone vessel sink, complemented by brushed bronze fixtures and an organic potted tree, enhancing the serene, spa-like ambiance. Abundant natural light washes over the space, creating gentle shadows and highlighting the clean lines and textural blend of wood and stone.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_7.jpg"
    },
    {
        "File Name": "bathroom_minimalist_56.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_56.jpg",
        "Style": "minimalist",
        "Generated Title": "Sleek Contemporary Bathroom: Neutral Hues and Matte Black Elegance",
        "Generated Description": "This contemporary bathroom showcases a minimalist design with a sophisticated neutral palette, featuring large format, light greige tiles that create a serene backdrop. The warmth of light wood cabinetry under a pristine white countertop perfectly complements the striking matte black fixtures and a frameless glass shower enclosure, adding a bold, modern contrast. Integrated strip lighting provides a soft, ambient glow, enhancing the clean lines and understated elegance of the wall-mounted toilet and walk-in shower with its convenient built-in niche.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_56.jpg"
    },
    {
        "File Name": "bathroom_minimalist_4.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_4.jpg",
        "Style": "minimalist",
        "Generated Title": "Serene Modern Bathroom with Earthy Tones and Clean Lines",
        "Generated Description": "This modern minimalist bathroom showcases a serene blend of natural materials and neutral colors, featuring a light wood floating vanity with a soft grey counter and a contrasting dark grey concrete basin. The walls are finished in light beige tiles, complemented by a large circular mirror with a dark frame, while the adjacent shower enclosure is frameless glass. The space is brightly illuminated by natural light from a window within the shower and ambient lighting, highlighting the clean lines, earthy tones, and overall sophisticated, uncluttered design, with simple green foliage adding a touch of organic warmth.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_4.jpg"
    },
    {
        "File Name": "bathroom_minimalist_64.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_64.jpg",
        "Style": "minimalist",
        "Generated Title": "Modern Earth-Toned Bathroom with Minimalist Elegance",
        "Generated Description": "This contemporary bathroom showcases a harmonious blend of earthy beige and taupe large-format tiles, with some walls featuring a subtle herringbone pattern, creating a warm and inviting atmosphere. Black minimalist fixtures, including the sleek shower frame, shower head, and ceiling spotlights, provide sharp contrast against the light wood floating vanity with its white countertop and ceramic bowl sink. The design emphasizes clean lines, natural textures, and a calming aesthetic, beautifully lit by modern recessed lighting and accented by a large circular mirror and dried botanical decor.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_64.jpg"
    },
    {
        "File Name": "bathroom_minimalist_12.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_12.jpg",
        "Style": "minimalist",
        "Generated Title": "Tranquil Greige Bathroom Featuring Natural Wood Details",
        "Generated Description": "This minimalist and modern bathroom exhibits a serene aesthetic, predominantly featuring a 'greige' microcement or large-format tile finish on the walls and floor, complemented by natural medium-toned wood elements. A vertical recessed niche with warm LED strip lighting and small wooden shelves adds subtle accentuation and functionality, while the integrated wall-mounted toilet and seamless cabinetry maintain clean lines. The overall design, with its exposed wooden ceiling beams and wooden door, blends rustic warmth with contemporary elegance, creating a calm, spa-like atmosphere.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_12.jpg"
    },
    {
        "File Name": "bathroom_minimalist_52.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_52.jpg",
        "Style": "minimalist",
        "Generated Title": "Sophisticated Modern Bathroom with Warm Terracotta and Stone",
        "Generated Description": "This contemporary bathroom design features a harmonious blend of materials, including vertically stacked terracotta-hued tiles in the shower, contrasted with smooth light beige walls and a textured, light-colored stone panel. Matte black fixtures provide sleek modern accents against the warm, earthy palette, complemented by recessed ceiling spotlights and a warm LED strip light that illuminates the space with a tranquil glow. The overall design incorporates minimalist lines with an organic modern touch, highlighted by a clean white vanity and a rustic wooden stool.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_52.jpg"
    },
    {
        "File Name": "bathroom_minimalist_22.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_22.jpg",
        "Style": "minimalist",
        "Generated Title": "Sophisticated Modern Bathroom: Stone, Wood, and Warm Lighting",
        "Generated Description": "This sophisticated modern bathroom features a luxurious blend of materials, including large format taupe marble or stone tiles covering the walls and floor, complemented by a dark brown wooden floating vanity. A crisp white vessel sink and wall-mounted toilet maintain clean lines, while copper-toned fixtures add a touch of warmth and elegance. Subtle LED strip lighting beneath the mirror, along with a decorative lighted wall sculpture, illuminates the space, creating a serene and inviting atmosphere with its earthy color palette.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_22.jpg"
    },
    {
        "File Name": "bathroom_minimalist_34.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_34.jpg",
        "Style": "minimalist",
        "Generated Title": "Sleek Minimalist Bathroom with Warm Backlighting",
        "Generated Description": "This minimalist bathroom showcases a seamless, integrated design with a soothing warm off-white palette. Smooth, uniform finishes on the walls and floating vanity, paired with a white wall-mounted toilet and matte black fixtures, define the modern aesthetic. Warm LED strip lighting beautifully backlights the frameless mirror and accents the ceiling, creating an inviting and serene ambiance.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_34.jpg"
    },
    {
        "File Name": "bathroom_minimalist_128.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_128.jpg",
        "Style": "minimalist",
        "Generated Title": "Modern Zen Bathroom: White, Bright, and Spa-Like",
        "Generated Description": "This modern, minimalist bathroom features a pristine white color palette, creating a serene and spa-like atmosphere with smooth, light-toned ceramic surfaces defining the walls and floors. Ambient lighting from hidden LED strips illuminates the steps leading to the elevated, sunken bathtub, while matte black fixtures in the walk-in shower provide a striking contemporary contrast, all brightened by natural light from a window and touches of greenery.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_128.jpg"
    },
    {
        "File Name": "bathroom_minimalist_8.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_8.jpg",
        "Style": "minimalist",
        "Generated Title": "Sleek Modern Bathroom: Black Frames and Warm Neutrals",
        "Generated Description": "This modern minimalist bathroom showcases a sophisticated design dominated by warm neutral tones and stark matte black accents. Large format light beige marble-effect tiles adorn the walls, complemented by white floor tiles and a wall-mounted white ceramic toilet, while indirect warm LED strip lighting illuminates the upper wall. The focal point is the elegant black-framed clear glass shower enclosure, with matching black fixtures like the showerhead, controls, and accessories providing striking contrast and defining the room's clean lines and functional elegance.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_8.jpg"
    },
    {
        "File Name": "bathroom_minimalist_112.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_112.jpg",
        "Style": "minimalist",
        "Generated Title": "Organic Modern Washroom: Sage Green, Terracotta, and Asymmetrical Mirrors",
        "Generated Description": "This contemporary washroom features a soothing palette of matte sage green on the minimalist vanity and integrated planters, beautifully complemented by light grey textured walls and matching large-format floor tiles. The design incorporates organically shaped, dark-tinted mirrors and pristine white cylindrical vessel sinks, creating a sculptural and sophisticated aesthetic. Striking terracotta-colored pendant lights, suspended from a sleek dark metal bar with elegant curves, provide focused illumination, while subtle recessed ceiling lights offer ambient glow, enhancing the natural light and the large tropical plants that infuse a calming biophilic element into the space.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_112.jpg"
    },
    {
        "File Name": "bathroom_minimalist_96.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_96.jpg",
        "Style": "minimalist",
        "Generated Title": "Sleek Bathroom Oasis with Ambient Lighting and Neutral Palette",
        "Generated Description": "This modern minimalist bathroom boasts a serene and luxurious design, characterized by a neutral palette of light creams, beiges, and subtle greys, emphasizing clean lines and an uncluttered aesthetic. Materials include large-format light-toned tiles for the walls and floor, a sleek white solid surface vanity with a dark wood shelf, and a glass shower enclosure with slim black framing. The sophisticated lighting scheme features recessed spotlights, ambient ceiling cove lighting, an integrated horizontal LED strip in the shower, and a striking circular light fixture, creating a warm, inviting glow.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_96.jpg"
    },
    {
        "File Name": "bathroom_minimalist_29.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_29.jpg",
        "Style": "minimalist",
        "Generated Title": "Warm Wood and Soft Glow: A Modern Minimalist Bath",
        "Generated Description": "This serene, modern minimalist bathroom features a tranquil design dominated by a warm, neutral color palette. Light natural wood forms the floating vanity and open shelving, contrasting elegantly with the soft beige textured walls and white ceramic fixtures. Subtle yet impactful lighting includes an oval backlit mirror providing a gentle ambient glow, complemented by a sleek black minimalist pendant light and matching faucets. The overall design emphasizes clean lines, natural textures like pampas grass, and a spa-like atmosphere, blending functionality with a calming aesthetic.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_29.jpg"
    },
    {
        "File Name": "bathroom_minimalist_54.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_54.jpg",
        "Style": "minimalist",
        "Generated Title": "Serene Modern Bathroom: Natural Textures and Minimalist Design",
        "Generated Description": "This serene modern bathroom showcases a minimalist design aesthetic, characterized by a palette of warm neutrals, natural wood, and sleek matte black accents. Textured plaster walls and a freestanding oval tub create a spa-like ambiance, complemented by a floating light wood vanity, black framed glass shower, and rustic wooden furniture. Recessed ceiling spotlights provide soft, warm illumination, enhanced by a flickering candle, all contributing to a tranquil and inviting atmosphere.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_54.jpg"
    },
    {
        "File Name": "bathroom_minimalist_51.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_51.jpg",
        "Style": "minimalist",
        "Generated Title": "Sleek Bathroom: Wood, Marble, and Ambient Glow",
        "Generated Description": "This modern minimalist bathroom showcases a luxurious blend of warm light-toned wood paneling, elegant white marble with subtle grey veining, and sleek matte black fixtures, creating a sophisticated and inviting atmosphere. Ambient LED strip lighting, recessed spotlights, and a warm glow accentuate the clean lines and well-organized design, highlighting the seamless integration of a spacious walk-in shower, a floating wood vanity with an integrated sink, and a wall-mounted toilet, all contributing to a spa-like contemporary aesthetic.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_51.jpg"
    },
    {
        "File Name": "bathroom_minimalist_84.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_84.jpg",
        "Style": "minimalist",
        "Generated Title": "Serene Modern Bathroom: Wood and Stone Harmony",
        "Generated Description": "This modern and minimalist bathroom exudes a serene aesthetic through its warm neutral palette and clean design. The walls and floor are clad in large, matte-finish beige/taupe tiles, complemented by a light wood veneer floating vanity with a white bowl sink and a sleek matte black faucet. Above the vanity, a large circular mirror features elegant backlighting, enhanced by two striking black cylindrical spot lights, while a wall-hung toilet maintains the uncluttered look, creating a sophisticated and inviting atmosphere.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_84.jpg"
    },
    {
        "File Name": "bathroom_minimalist_110.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_110.jpg",
        "Style": "minimalist",
        "Generated Title": "Contemporary Bathroom: Serene Greys and Warm Copper",
        "Generated Description": "This modern, minimalist bathroom showcases a serene palette of light greys and white, beautifully contrasted by striking matte copper fixtures and natural wood elements. The design incorporates a wet room with vertical stacked tiles, a textured beige stone vanity with an integrated sink, and light blonde wood cabinetry, all brightly illuminated by recessed ceiling lights and a small black-framed window. Organic touches like patterned towels and potted greenery enhance the clean, contemporary aesthetic.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_110.jpg"
    },
    {
        "File Name": "bathroom_minimalist_13.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_13.jpg",
        "Style": "minimalist",
        "Generated Title": "Serene Modern Bathroom with Textured Walls",
        "Generated Description": "This modern minimalist bathroom presents a tranquil design, primarily in a warm, neutral color palette of light beige and greige, enhanced by a soft, warm glow from a single cylindrical pendant light. The walls are clad in vertically ribbed, textured tiles, contrasting subtly with the large-format floor tiles and an integrated floating vanity and sink made of matte stone or concrete. Accents include a thin black-framed mirror, matte black plumbing fixtures, a black wall-mounted toilet flush, and a light wooden shelf beneath the vanity, all contributing to a sleek, spa-like aesthetic.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_13.jpg"
    },
    {
        "File Name": "bathroom_minimalist_55.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_55.jpg",
        "Style": "minimalist",
        "Generated Title": "Tranquil Sage Green and Marble Modern Toilet Room",
        "Generated Description": "This modern and minimalist toilet room features calming sage green and crisp white two-toned walls, complemented by a light grey tiled floor and elegant white marble-look tiles behind the wall-mounted toilet. Natural light streams in through the black-framed window, illuminating the space which is further warmed by a woven pendant light and light wood shelving. Decorative accents like dried pampas grass and a trio of round mirrors complete this chic and serene design.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_55.jpg"
    },
    {
        "File Name": "bathroom_minimalist_14.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_14.jpg",
        "Style": "minimalist",
        "Generated Title": "Elegant Contemporary Shower with Warm Bronze Accents",
        "Generated Description": "This elegant contemporary shower showcases large format, light beige matte tiles, creating a serene and sophisticated backdrop for the warm bronze and copper-toned fixtures, including a rain showerhead and hand shower. A key design element is the recessed shower niche, subtly lit by a warm LED strip light, providing both practical storage and an ambient glow that enhances the overall luxurious and minimalist aesthetic of the space.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_14.jpg"
    },
    {
        "File Name": "bathroom_minimalist_42.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_42.jpg",
        "Style": "minimalist",
        "Generated Title": "Sophisticated Modern Bathroom with Fluted Textures and Warm Lights",
        "Generated Description": "This sophisticated modern bathroom showcases a rich blend of textures and a refined neutral color palette. Materials include elegant grey marble-look tiles, striking fluted vertical wall paneling, and a unique geometric patterned tiled floor, complemented by a dark teal fluted vanity and a sleek white ceramic vessel sink. Integrated warm LED lighting frames the arched gold-toned mirror and illuminates a practical wall niche, enhancing the luxurious, contemporary design.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_42.jpg"
    },
    {
        "File Name": "bathroom_minimalist_126.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_126.jpg",
        "Style": "minimalist",
        "Generated Title": "Tranquil Modern Bathroom Featuring Elegant LED Strip Lighting",
        "Generated Description": "This modern bathroom embodies a serene and sophisticated design, characterized by clean lines and warm, inviting colors. The space primarily utilizes large format light grey marble-effect tiles for walls, a floating light wood grain vanity with a white countertop and rectangular ceramic sink, and a sleek glass shower enclosure with matte black fixtures. Warm white LED strip lighting, elegantly integrated beneath the vanity and above the expansive frameless mirror, casts a soft, ambient glow that beautifully highlights the minimalist aesthetic and creates a spa-like atmosphere.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_126.jpg"
    },
    {
        "File Name": "bathroom_minimalist_23.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_23.jpg",
        "Style": "minimalist",
        "Generated Title": "Japandi-Inspired Bathroom: Minimalist Design with Natural Warmth",
        "Generated Description": "This modern bathroom showcases a minimalist, Japandi-inspired style, utilizing a serene palette of earthy neutrals. The walls and integrated floating vanity are finished in a light greige, textured concrete-like material, perfectly complemented by warm, natural wood cabinetry and open shelving. Soft recessed ceiling lights and a prominent vertical LED strip on the left wall provide gentle, ambient illumination, enhancing the calm atmosphere, while a simple black-framed mirror and round natural fiber rugs complete the elegantly uncluttered design.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_23.jpg"
    },
    {
        "File Name": "bathroom_minimalist_0.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\minimalist\\images\\bathroom_minimalist_0.jpg",
        "Style": "minimalist",
        "Generated Title": "Serene Minimalist Bathroom with Warm Natural Tones and Lighting",
        "Generated Description": "This tranquil minimalist bathroom features a cohesive design dominated by natural materials and a warm, earthy color palette. Textured beige walls and a light stone vanity top with a matching vessel sink are complemented by warm wooden accents seen in the slatted wall paneling, oval mirror frame, and floating vanity shelf. Soft, ambient lighting from a ceiling spotlight, a cove light above the mirror, and an under-vanity LED strip creates a serene and inviting atmosphere, highlighting the space's clean lines and organic touches like the pampas grass and arched wall niche.",
        "file_url": "/static/minimalist/images/bathroom_minimalist_0.jpg"
    },
    {
        "File Name": "bathroom_boho_51.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_51.jpg",
        "Style": "boho",
        "Generated Title": "Serene Biophilic Bathroom with Lush Greenery and Skylight",
        "Generated Description": "This modern biophilic bathroom showcases a tranquil, nature-inspired design, utilizing light wood tones for the floating vanity and floor, complemented by textured concrete walls in a neutral palette of beige and grey. Abundant natural light streams through a large skylight over the glass-enclosed shower, enhanced by warm artificial light from elegant wooden pendant fixtures flanking the basin. The space is lush with various tropical plants, creating a serene, spa-like oasis that seamlessly merges indoor comfort with the vibrant outdoors.",
        "file_url": "/static/boho/images/bathroom_boho_51.jpg"
    },
    {
        "File Name": "bathroom_boho_52.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_52.jpg",
        "Style": "boho",
        "Generated Title": "Lush Bohemian Bathroom Retreat with Natural Light",
        "Generated Description": "This image reveals a vibrant, biophilic bathroom showcasing a bohemian design aesthetic, rich with natural elements and warm tones. Crisp white subway tiles provide a clean backdrop for abundant greenery from various hanging and potted plants, complemented by a rustic wooden mirror and matching vanity. Warm natural light streams in from a window, creating soft shadows and highlighting the intricately patterned floor tiles and a colorful accent rug, which together form an inviting and eclectic ambiance.",
        "file_url": "/static/boho/images/bathroom_boho_52.jpg"
    },
    {
        "File Name": "bathroom_boho_85.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_85.jpg",
        "Style": "boho",
        "Generated Title": "Stylish Boho Bathroom with Abstract Art and Earthy Decor",
        "Generated Description": "This inviting modern bohemian bathroom features a harmonious blend of earthy tones, including warm terracotta, deep browns, and vibrant greens against light grey walls and a light wood floor. The design incorporates a dark wood vanity with a cream countertop, a white ceramic toilet, and a bold black-and-white patterned shower curtain, all brightly illuminated by unseen ambient overhead lighting that enhances the cozy and stylish atmosphere. Abstract art pieces in black, white, and rust hues adorn the walls, complementing the traditional patterned red and beige rugs that add warmth and texture to the space, with materials like wood, ceramic, fabric, and canvas creating a layered, curated look.",
        "file_url": "/static/boho/images/bathroom_boho_85.jpg"
    },
    {
        "File Name": "bathroom_boho_1.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_1.jpg",
        "Style": "boho",
        "Generated Title": "Eclectic Bathroom Oasis: Warm Tones and Patterned Tiles",
        "Generated Description": "This eclectic bathroom masterfully blends rustic and Mediterranean styles, featuring a stunning accent wall of intricate patterned tiles in warm earth tones with pops of blues and greens. Multiple pendant lights with glass shades, along with subtle under-shelf LEDs and a recessed ceiling light, create a warm, inviting glow that highlights the natural wood ceiling, wooden floating shelves, and textured walls, completing a cozy and richly designed space.",
        "file_url": "/static/boho/images/bathroom_boho_1.jpg"
    },
    {
        "File Name": "bathroom_boho_31.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_31.jpg",
        "Style": "boho",
        "Generated Title": "Warm Modern Bathroom with Minimalist Luxury",
        "Generated Description": "This elegant modern bathroom embodies a luxurious, minimalist style, showcasing a warm palette of beige and brown natural stone tiles that cover the walls and floor, creating a cohesive design. A sleek floating matte black vanity with a white countertop is complemented by a suspended oval mirror and contemporary spherical pendant lights, while subtle integrated strip lighting above the glass shower creates a serene and inviting atmosphere.",
        "file_url": "/static/boho/images/bathroom_boho_31.jpg"
    },
    {
        "File Name": "bathroom_boho_3.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_3.jpg",
        "Style": "boho",
        "Generated Title": "Modern Rustic Bathroom Retreat with Organic Textures",
        "Generated Description": "This tranquil bathroom features a sophisticated blend of raw and refined materials, with rugged natural stone walls in earthy beige and grey tones contrasting with smooth, light-colored plaster and warm wooden accents. The design embraces a modern rustic style, showcasing a sleek concrete vanity with a rough-hewn stone basin, dark bronze fixtures, and a floating toilet. Soft, natural light enhances the organic textures and neutral palette, creating a serene and inviting spa-like retreat.",
        "file_url": "/static/boho/images/bathroom_boho_3.jpg"
    },
    {
        "File Name": "bathroom_boho_11.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_11.jpg",
        "Style": "boho",
        "Generated Title": "Warm Neutral Bathroom Oasis: Boho Textures and Soft Lighting",
        "Generated Description": "This inviting bathroom showcases a warm, bohemian style with a dominant palette of natural neutrals including various shades of beige, cream, and sand. Key materials include textured plaster walls, smooth white ceramic for the bathtub and basin, and abundant woven rattan or jute for the large round mirror frame, decorative baskets, pendant lights, and circular floor rugs, all contributing to an organic feel. Soft, warm lighting emanates from a hidden LED strip illuminating the top wall and vanity, complemented by the ambient glow of the unique woven pendant lamps and a subtle flickering candle, creating a serene and spa-like retreat that feels both rustic and refined.",
        "file_url": "/static/boho/images/bathroom_boho_11.jpg"
    },
    {
        "File Name": "bathroom_boho_74.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_74.jpg",
        "Style": "boho",
        "Generated Title": "Zen Spa Retreat with Forest Panorama",
        "Generated Description": "This luxurious, modern zen-style bathroom beautifully integrates natural elements, featuring warm wooden floors, ceilings, and bespoke cabinetry contrasted with cool grey stone walls and a matching basin sink. Soft, ambient lighting from strategically placed pendant lights and candles, complemented by ample natural light streaming through the expansive floor-to-ceiling window, enhances the serene atmosphere, creating a tranquil sanctuary dominated by earthy browns, muted greys, and vibrant greens from the surrounding lush greenery.",
        "file_url": "/static/boho/images/bathroom_boho_74.jpg"
    },
    {
        "File Name": "bathroom_boho_25.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_25.jpg",
        "Style": "boho",
        "Generated Title": "Elegant Neutral Bathroom featuring Organic LED Mirror Design",
        "Generated Description": "This modern minimalist bathroom showcases a serene neutral color palette dominated by various shades of beige and light brown, creating a warm and inviting ambiance. Key design elements include a floating wooden vanity with a distinctive fluted texture, a pristine white vessel sink, and an eye-catching organic-shaped mirror elegantly backlit with LED lighting. The space is further defined by large-format tiles on the walls, a speckled floor, and recessed ceiling spotlights, all contributing to a clean, sophisticated, and functional contemporary design.",
        "file_url": "/static/boho/images/bathroom_boho_25.jpg"
    },
    {
        "File Name": "bathroom_boho_61.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_61.jpg",
        "Style": "boho",
        "Generated Title": "Luxury Modern Bathroom: Stone, Wood, and Golden Glow",
        "Generated Description": "This luxurious modern bathroom showcases a sophisticated palette of warm browns, beiges, and greys, utilizing large-format marble-look tiles for walls and flooring, alongside rich dark wood paneling and a fluted wood vanity. The contemporary design emphasizes clean lines and circular motifs, with prominent backlit round mirrors and recessed ceiling spotlights casting a warm, inviting glow throughout the serene, spa-like space.",
        "file_url": "/static/boho/images/bathroom_boho_61.jpg"
    },
    {
        "File Name": "bathroom_boho_79.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_79.jpg",
        "Style": "boho",
        "Generated Title": "Boho Chic Bathroom Oasis: Natural Light and Greenery",
        "Generated Description": "This stunning bohemian-style bathroom creates a tranquil oasis using a palette of earthy tones and vibrant greens. Natural materials abound, including light-toned wood for the vanity and mirror frames, woven rattan for decor and floor rugs, and ceramic/stone for the sink, toilet, and shower enclosure. Abundant natural light streams through a window, casting beautiful patterns on the light-colored floor and illuminating the space, further enhancing the warm, spa-like ambiance through its organic design and numerous lush tropical plants.",
        "file_url": "/static/boho/images/bathroom_boho_79.jpg"
    },
    {
        "File Name": "bathroom_boho_10.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_10.jpg",
        "Style": "boho",
        "Generated Title": "Rustic Retreat: Organic Wood and Stone Bathroom",
        "Generated Description": "This image showcases a beautifully designed rustic bathroom vanity, characterized by its emphasis on natural materials and organic forms. The focal point is a thick, live-edge wood slab serving as the counter, supporting a rough-hewn, dark grey natural stone basin sink, complemented by a dark metal faucet, all beneath an irregularly shaped, gnarled live-edge wood mirror frame set against a textured concrete wall. The design exudes a wabi-sabi aesthetic with its raw textures, earthy color palette of warm browns, muted greys, and off-whites, and minimalist styling, enhanced by soft natural light filtering in, with amber glass bottles and a fresh bouquet of light-colored flowers adding delicate touches of life.",
        "file_url": "/static/boho/images/bathroom_boho_10.jpg"
    },
    {
        "File Name": "bathroom_boho_84.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_84.jpg",
        "Style": "boho",
        "Generated Title": "Earthy Oasis: Bohemian Bathroom with Natural Textures",
        "Generated Description": "This inviting bohemian bathroom features walls with a warm, peachy-orange stucco finish and exposed rustic texture, complemented by terracotta floor tiles and dark wooden ceiling beams. Natural materials dominate the design, including wooden shelves, a woven wall hanging, a striped rug, and living plants like succulents and hanging greens. The space is brightly illuminated by an unseen light source, creating a warm, organic, and serene overall design that blends rustic charm with a relaxed, earthy aesthetic.",
        "file_url": "/static/boho/images/bathroom_boho_84.jpg"
    },
    {
        "File Name": "bathroom_boho_8.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_8.jpg",
        "Style": "boho",
        "Generated Title": "Opulent Green Retreat with Vintage Glamour",
        "Generated Description": "This luxurious bathroom embodies a sophisticated botanical chic style, featuring a rich palette of deep emerald greens from glossy subway tiles on the lower walls and an organic patterned wallpaper above. A dark wood vanity with bronze pulls grounds the space, topped by a sleek circular brass sink and an ornate gilded mirror, all brilliantly illuminated by a dazzling crystal chandelier and warm, inviting brass wall sconces. Lush hanging ferns, framed botanical prints, and a textured earthy rug complete the design, creating an opulent, verdant retreat with a warm, inviting glow.",
        "file_url": "/static/boho/images/bathroom_boho_8.jpg"
    },
    {
        "File Name": "bathroom_boho_29.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_29.jpg",
        "Style": "boho",
        "Generated Title": "Warm Eclectic Bathroom with Tiled Accent Wall",
        "Generated Description": "This cozy bathroom showcases a fusion of bohemian and Mediterranean styles, featuring a stunning accent wall of colorful patterned tiles, warm wooden ceilings and vanity, and ceramic fixtures. Warm ambient lighting from three spherical pendant lamps and hidden LED strips highlights the earthy tones and natural textures, creating an inviting and intricately designed space.",
        "file_url": "/static/boho/images/bathroom_boho_29.jpg"
    },
    {
        "File Name": "bathroom_boho_80.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_80.jpg",
        "Style": "boho",
        "Generated Title": "Tranquil Bohemian Bathroom with Organic Accents",
        "Generated Description": "This serene bohemian bathroom features an earthy palette of warm browns, terracotta, natural wood tones, and soft greys, creating a calming, spa-like retreat. The design seamlessly blends rustic charm with modern elements, emphasizing natural textures and a harmonious connection to nature. Materials include woven rattan and wicker accents, light-toned wood furniture, textured grey walls, dark flooring, and lush green plants, all illuminated by abundant natural light from a large window complemented by soft ambient lighting and decorative hanging fixtures.",
        "file_url": "/static/boho/images/bathroom_boho_80.jpg"
    },
    {
        "File Name": "bathroom_boho_7.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_7.jpg",
        "Style": "boho",
        "Generated Title": "Serene Natural Bathroom: Stone, Wood, and Light",
        "Generated Description": "This inviting bathroom showcases an organic modern style, blending light-colored natural stone on the walls and floor with a striking live-edge wood slab vanity and a rectangular stone vessel sink. An oval mirror, warm recessed ceiling lights, and soft natural light enhance the calming, earthy palette dominated by creams, beiges, and natural wood tones. The overall design emphasizes natural textures and materials, from the woven rug and baskets to the rustic exposed wood ceiling in the shower area, creating a peaceful, spa-like retreat.",
        "file_url": "/static/boho/images/bathroom_boho_7.jpg"
    },
    {
        "File Name": "bathroom_boho_34.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_34.jpg",
        "Style": "boho",
        "Generated Title": "Earthy Bohemian Bathroom Oasis of Light and Texture",
        "Generated Description": "This serene bathroom showcases a bohemian and earthy design, utilizing natural materials like textured stone tiles, a raw stone/concrete countertop, and various woven natural fiber elements for the rug, baskets, and decorative pendant lights. The dominant color palette consists of warm neutrals, including shades of beige, cream, and light brown, accented by dark bronze faucets, creating a tranquil and spa-like atmosphere. Abundant natural light streams through the window, illuminating the space and highlighting the organic textures and the large pampas grass plumes.",
        "file_url": "/static/boho/images/bathroom_boho_34.jpg"
    },
    {
        "File Name": "bathroom_boho_57.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_57.jpg",
        "Style": "boho",
        "Generated Title": "Warm Modern Bathroom with Integrated Lighting and Natural Materials",
        "Generated Description": "This luxurious modern bathroom showcases a harmonious blend of natural materials, featuring warm beige and cream veined stone on the walls, floor, and a sleek floating countertop, beautifully contrasted with rich, dark wood cabinetry and integrated display shelves. Strategically placed warm LED strip lighting illuminates the vanity's underside, within the display niches, and around the large frameless mirror, creating a sophisticated, spa-like ambiance that perfectly complements the contemporary design's clean lines and inviting color palette.",
        "file_url": "/static/boho/images/bathroom_boho_57.jpg"
    },
    {
        "File Name": "bathroom_boho_82.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_82.jpg",
        "Style": "boho",
        "Generated Title": "Modern Bohemian Bathroom Oasis with Patterned Floor",
        "Generated Description": "This bright, modern bohemian bathroom features a clean design with warm wood and striking patterns. Materials include white subway tiles in the shower, distinct black and white hexagonal floor tiles, a light wood floating vanity, and coordinating shelves. A brass double-bulb sconce above an oval black-framed mirror provides warm light, complementing the predominantly white color scheme accented with black and natural green plants.",
        "file_url": "/static/boho/images/bathroom_boho_82.jpg"
    },
    {
        "File Name": "bathroom_boho_58.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_58.jpg",
        "Style": "boho",
        "Generated Title": "Live-Edge Wood Vanity: Nature-Inspired Bathroom Design",
        "Generated Description": "This tranquil bathroom vanity showcases a harmonious blend of natural materials and organic design. A unique, live-edge wood slab forms the vanity countertop and its sculptural support leg, complemented by a perfectly matched wooden vessel sink and an irregularly shaped, natural wood-framed mirror. The design embraces a modern rustic and biophilic style, featuring warm brown wood tones against a light, neutral wall, enhanced by natural light reflecting greenery and subtle dark metal accents from the wall-mounted faucet.",
        "file_url": "/static/boho/images/bathroom_boho_58.jpg"
    },
    {
        "File Name": "bathroom_boho_33.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_33.jpg",
        "Style": "boho",
        "Generated Title": "Earthy Oasis: A Boho-Inspired Bathroom Retreat",
        "Generated Description": "This inviting bathroom design beautifully marries rustic charm with bohemian elegance, featuring abundant natural wood for the ceiling and vanity, textured plaster walls, and patterned terracotta-toned tiles, all within a warm, earthy color palette. Natural sunlight bathes the space, creating dynamic shadows and highlighting lush green plants, complemented by subtle recessed lights and a unique wooden pendant, fostering a serene and spa-like atmosphere.",
        "file_url": "/static/boho/images/bathroom_boho_33.jpg"
    },
    {
        "File Name": "bathroom_boho_26.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_26.jpg",
        "Style": "boho",
        "Generated Title": "Natural Stone and Wood Spa Bathroom Retreat",
        "Generated Description": "This luxurious bathroom showcases a rustic modern design, utilizing natural materials like stacked stone veneer walls and a stunning live-edge wooden slab vanity. A carved natural stone basin sink is paired with a large circular backlit mirror, emitting a warm glow that complements the recessed ceiling lights and under-shelf accent lighting. The color palette features rich earthy browns, deep greys, and hints of rust, creating a serene and inviting spa-like atmosphere, enhanced by lush green plants and a warm candle.",
        "file_url": "/static/boho/images/bathroom_boho_26.jpg"
    },
    {
        "File Name": "bathroom_boho_4.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_4.jpg",
        "Style": "boho",
        "Generated Title": "Lush Terracotta Oasis: Natural Boho Bathroom Design",
        "Generated Description": "This inviting bathroom design showcases a warm, bohemian aesthetic, dominated by earthy terracotta plastered walls and patterned clay floor tiles, complemented by natural wood cabinetry and a sleek white ceramic basin. Lush green plants are strategically placed throughout, creating an oasis feel, beautifully illuminated by abundant natural light from a large window—reflected in a prominent round wooden mirror—and supplemented by a singular industrial-chic pendant light. The overall design emphasizes natural materials, warm textures, and a serene, organic ambiance.",
        "file_url": "/static/boho/images/bathroom_boho_4.jpg"
    },
    {
        "File Name": "bathroom_boho_0.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_0.jpg",
        "Style": "boho",
        "Generated Title": "Tranquil Bohemian Bathroom with Warm Wood Tones",
        "Generated Description": "This tranquil bathroom design embraces a bohemian and natural style, featuring an earthy color palette of creams, beiges, and warm browns. Key materials include light textured stone tiles, dark rich wood for the floating vanity and ceiling beams, and abundant woven natural fibers seen in the pendant lights, rugs, baskets, and decorative elements. Warm, inviting ambient light is provided by three distinct woven pendant lights, complemented by natural light from the right, contributing to a spa-like atmosphere enhanced by lush greenery and minimalist black fixtures.",
        "file_url": "/static/boho/images/bathroom_boho_0.jpg"
    },
    {
        "File Name": "bathroom_boho_60.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_60.jpg",
        "Style": "boho",
        "Generated Title": "Sleek Natural Bathroom Retreat",
        "Generated Description": "This modern, spa-inspired bathroom features a harmonious blend of natural materials and warm lighting, creating a tranquil atmosphere. Textured grey-taupe tiles clad the walls and floor, complementing a floating wooden vanity with a natural stone basin and a sleek white freestanding bathtub. Warm recessed spotlights, copper-toned wall sconces, and delicate pendant lights illuminate the space, enhancing the earthy color palette and vibrant indoor plants, all set against a large window framing lush outdoor greenery.",
        "file_url": "/static/boho/images/bathroom_boho_60.jpg"
    },
    {
        "File Name": "bathroom_boho_87.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_87.jpg",
        "Style": "boho",
        "Generated Title": "Cozy Bathroom with Blue Tiles and Warm Glow",
        "Generated Description": "This charming bathroom features vibrant blue and white patterned wall tiles and a deep blue vanity with a light wood countertop, creating an inviting eclectic style. Warm copper-toned shelving and fixtures, including a unique towel rack and shower rod, add a touch of rustic modernism to the space. Ambient lighting from overhead fixtures is softened by the warm glow of candles, enhancing the cozy atmosphere and complementing the white clawfoot tub and patterned blue bath mat.",
        "file_url": "/static/boho/images/bathroom_boho_87.jpg"
    },
    {
        "File Name": "bathroom_boho_83.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_83.jpg",
        "Style": "boho",
        "Generated Title": "Serene Bohemian Bathroom: Natural Light, Wood, and Greenery",
        "Generated Description": "This serene bathroom embodies a bohemian and natural design style, featuring a tranquil palette of warm whites, natural wood tones, and vibrant green accents from numerous potted plants. Abundant natural light pours in from a large window, enhancing the airy and inviting atmosphere. The space thoughtfully incorporates light wood for countertops, shelving units, and the floor, complemented by ceramic fixtures, soft woven textiles like a tasseled bath mat, and wicker plant baskets, creating a harmonious and spa-like retreat.",
        "file_url": "/static/boho/images/bathroom_boho_83.jpg"
    },
    {
        "File Name": "bathroom_boho_5.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_5.jpg",
        "Style": "boho",
        "Generated Title": "Elegant Modern Bathroom with Earthy Bohemian Vibe",
        "Generated Description": "This elegant bathroom combines modern design with a warm, earthy bohemian aesthetic, showcasing a rich palette of browns, warm greys, and off-white. Key materials include sleek grey subway tiles, intricately patterned floor tiles, a striking dark wood and woven cane partition, and a distinctive dark freestanding tub. Illumination is provided by charming woven rattan pendant lights, which beautifully complement the brass fixtures and natural textures, creating a serene and inviting atmosphere.",
        "file_url": "/static/boho/images/bathroom_boho_5.jpg"
    },
    {
        "File Name": "bathroom_boho_81.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\boho\\images\\bathroom_boho_81.jpg",
        "Style": "boho",
        "Generated Title": "Tranquil Bohemian Bathroom with Organic Accents",
        "Generated Description": "This serene bohemian bathroom features an earthy palette of warm browns, terracotta, natural wood tones, and soft greys, creating a calming, spa-like retreat. The design seamlessly blends rustic charm with modern elements, emphasizing natural textures and a harmonious connection to nature. Materials include woven rattan and wicker accents, light-toned wood furniture, textured grey walls, dark flooring, and lush green plants, all illuminated by abundant natural light from a large window complemented by soft ambient lighting and decorative hanging fixtures.",
        "file_url": "/static/boho/images/bathroom_boho_81.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_13.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_13.jpg",
        "Style": "scandinavian",
        "Generated Title": "Sleek Bathroom Oasis: White Tiles, Wood, and Black Details",
        "Generated Description": "This modern minimalist bathroom design exudes a bright and clean aesthetic, combining crisp white ceramic subway tiles laid in a herringbone pattern with contrasting black grout and black metal accents. Natural light-toned wood is prominently featured in the floating vanity and wall shelf, adding warmth and complementing the pristine white ceramic sink and toilet. The space is brilliantly lit, highlighting the functional black shower fixtures, frameless glass shower enclosure, and overall refined, contemporary style.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_13.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_66.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_66.jpg",
        "Style": "scandinavian",
        "Generated Title": "Elegant Minimalist Bathroom: White, Wood, and Light",
        "Generated Description": "This modern minimalist bathroom showcases a luxurious floating vanity made from light marble with subtle grey veining, beautifully contrasted with warm brown wood accents for the open shelf and accessories. The design emphasizes clean lines and a serene palette of whites, greys, and natural wood tones, dramatically illuminated by a large backlit mirror and recessed ceiling spotlights, creating a sophisticated and spa-like ambiance. A sleek matte black faucet with a hint of gold adds a contemporary touch to this elegant space.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_66.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_31.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_31.jpg",
        "Style": "scandinavian",
        "Generated Title": "Serene Minimalist Bathroom with Warm Neutral Tones",
        "Generated Description": "This minimalist modern bathroom exudes a tranquil ambiance, characterized by its warm neutral color palette of creams, beiges, and soft whites. The design features a sleek white floating vanity with an integrated sink and a light wood lower shelf, perfectly complemented by a tall, pill-shaped mirror framed in a subtle gold finish. Materials like smooth painted walls, large light-colored floor tiles, and a matte black wall-mounted faucet are bathed in abundant natural light from a large window, creating a clean, sophisticated, and calming space.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_31.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_83.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_83.jpg",
        "Style": "scandinavian",
        "Generated Title": "Modern Zen Vanity: Natural Tones and Clean Lines",
        "Generated Description": "This modern bathroom features a serene and minimalist design, emphasizing natural materials and a soothing color palette. The vanity comprises a light gray concrete or stone countertop and a sleek circular vessel sink, paired with a natural light wood open-shelf unit, accentuated by chrome fixtures. The background wall is clad in vertical ribbed, light beige tiles, crowned by a large circular mirror with an artistic segmented design, subtly illuminated by an integrated LED strip light, creating a calm and inviting atmosphere.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_83.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_33.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_33.jpg",
        "Style": "scandinavian",
        "Generated Title": "Serene Neutral Bathroom with Warm Gold Accents",
        "Generated Description": "This modern minimalist bathroom features a harmonious blend of warm neutral tones, with light beige wall tiles and a light wood veneer vanity boasting horizontal grain, complemented by a crisp white countertop. Brushed gold fixtures, including the sleek faucet, drawer pulls, and mirror frame, add a sophisticated touch and warmth, while recessed ceiling lights and elegant wall sconces cast a soft, inviting glow. A tall glass vase with delicate white blossoms provides a natural, organic element, enhancing the serene and sophisticated overall design.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_33.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_69.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_69.jpg",
        "Style": "scandinavian",
        "Generated Title": "Biophilic Modern Bathroom: Wood, Greenery, and Natural Light Oasis",
        "Generated Description": "This bright, modern bathroom embodies a biophilic design aesthetic, featuring light natural wood for the floating vanity and floor planks, complemented by sleek light grey tiled walls and a clear glass shower enclosure. Abundant natural light streams through a large window, illuminating the serene space filled with lush green plants, white ceramic basin sinks, and accented by elegant brushed brass fixtures, creating a tranquil and airy ambiance.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_69.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_16.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_16.jpg",
        "Style": "scandinavian",
        "Generated Title": "Cozy Neutral Bathroom Featuring Textured Walls and Globe Light",
        "Generated Description": "This contemporary bathroom design showcases warm, neutral tones, with vertical ribbed beige wall tiles creating a textured backdrop for the sleek white oval vessel sink and light beige vanity cabinets. The minimalist aesthetic is accentuated by a black-framed oval mirror and a subtle light grey countertop, complemented by a modern silver faucet. A single spherical white globe pendant light casts a soft, warm glow, enhancing the inviting and sophisticated ambiance of the space.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_16.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_10.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_10.jpg",
        "Style": "scandinavian",
        "Generated Title": "Modern Green Oasis: Wood, Plants, and Soft Lighting",
        "Generated Description": "This modern Scandinavian-style bathroom features soothing sage green walls, beautifully complemented by light natural wood tones seen in the floating vanity, expansive open shelving, and flooring. Warm ambient lighting is provided by a minimalist white pendant lamp and an integrated LED strip beneath the mirror, enhanced by generous natural light, all contributing to a clean, organic, and serene design accentuated by crisp white fixtures and vibrant green plants.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_10.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_26.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_26.jpg",
        "Style": "scandinavian",
        "Generated Title": "Sun-Drenched Spa Bathroom: Earthy Tones and Minimalism",
        "Generated Description": "This serene bathroom showcases a minimalist, organic style, predominantly featuring warm, earthy neutral tones of beige and cream on the textured walls, floor, and concrete-like vanity, complemented by natural wood elements like a live-edge shelf and a small stool. Abundant natural light streams in from the right, casting warm golden stripes and creating a tranquil, spa-like ambiance, enhanced by subtle recessed ceiling lights, dried pampas grass, and a simple, uncluttered design featuring a walk-in glass shower and integrated wall niches.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_26.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_41.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_41.jpg",
        "Style": "scandinavian",
        "Generated Title": "Bright, Serene Bathroom with Wood Tones and Modern Design",
        "Generated Description": "This modern and minimalist bathroom features a warm, inviting neutral palette, predominantly using light wood tones for the floating vanity and a stunning wood-look tiled accent wall in the shower, contrasted with creamy off-white floor tiles, solid surface countertop, and a sleek freestanding bathtub. Bright illumination is provided by numerous recessed LED downlights throughout the ceiling, enhancing the clean lines of the frameless glass shower enclosure and the overall spacious, spa-like atmosphere, completed with subtle greenery.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_41.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_80.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_80.jpg",
        "Style": "scandinavian",
        "Generated Title": "Contemporary Spa-Like Bathroom with Integrated Warm Lighting",
        "Generated Description": "This contemporary and minimalist bathroom showcases a sophisticated design centered on a warm, neutral color palette, blending light beige stone-effect wall tiles with natural wood-look flooring and a floating vanity. Strategic lighting, including multiple recessed ceiling spotlights, a prominent LED strip behind the frameless mirror, and subtle under-vanity illumination, creates a luxurious and inviting spa-like ambiance. The overall design emphasizes clean lines, natural textures, and modern functionality for a serene and elegant space.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_80.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_78.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_78.jpg",
        "Style": "scandinavian",
        "Generated Title": "Serene Wood and White Modern Powder Room",
        "Generated Description": "This modern and minimalist powder room showcases a serene blend of light wood slat paneling and smooth wooden accents, paired with speckled light grey tiles on the walls and floor, creating a warm, natural aesthetic. Crisp white ceramic fixtures, including a floating vanity with a vessel sink and a contemporary toilet, are contrasted with matte black hardware, while a circular backlit mirror and under-vanity strip lighting provide soft, elegant illumination, defining its clean and functional design.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_78.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_23.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_23.jpg",
        "Style": "scandinavian",
        "Generated Title": "Modern Minimalist Bathroom: Wood, White, and Woven Warmth",
        "Generated Description": "This contemporary minimalist bathroom showcases a warm, neutral palette with an emphasis on natural materials. Light wood planks adorn the ceiling and a floating vanity, harmonizing with light beige wall tiles and a clean white countertop and sink. Illumination is provided by a recessed ceiling light and a stylish backlit mirror, accentuating the clean lines and open shelving filled with woven baskets, crisp white towels, and subtle greenery. The design thoughtfully combines functionality with a serene aesthetic, using black matte fixtures as modern contrasts against the soft, earthy tones.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_23.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_30.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_30.jpg",
        "Style": "scandinavian",
        "Generated Title": "Modern Spa Bathroom: Elegant Wood and Marble Retreat",
        "Generated Description": "This sophisticated modern bathroom features a luxurious blend of materials, dominated by large format grey marble-effect tiles and warm, dark wood cabinetry and shelving. Integrated LED strip lighting provides a soft, ambient glow under the floating vanity and within the recessed niches, complementing the sleek, cylindrical pendant lights partially visible by the round mirror, creating a minimalist yet rich aesthetic with a calming palette of various greys and deep browns.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_30.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_11.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_11.jpg",
        "Style": "scandinavian",
        "Generated Title": "Earthy Serenity: Stone and Wood Bathroom",
        "Generated Description": "This luxurious bathroom showcases a biophilic design, masterfully blending raw nature with modern minimalism. Dominant materials include a magnificent natural rock wall, warm wooden ceilings and vanity, and a stone-clad bathtub and sink, all complemented by sleek dark metal fixtures and a glass shower partition. Soft, ambient lighting from hidden LED strips along the rock wall and recessed ceiling lights creates a warm, spa-like glow, enhancing the earthy palette of grays, browns, and natural beige tones for a truly tranquil and sophisticated retreat.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_11.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_15.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_15.jpg",
        "Style": "scandinavian",
        "Generated Title": "Skylit Sanctuary: A Modern Biophilic Bathroom Design",
        "Generated Description": "This modern and minimalist bathroom showcases a serene biophilic design, featuring a striking living green wall as a focal point, complemented by warm light wood paneling and cabinetry, and crisp white ceramic fixtures. The color palette is dominated by refreshing greens and earthy wood tones against a backdrop of light neutral walls and flooring. Abundant natural light pours in from a large central skylight, enhanced by discreet recessed ceiling lights and subtle vanity lighting, creating a bright and airy spa-like atmosphere with matte black fixtures and a gold-framed oval mirror adding elegant, contemporary accents.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_15.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_12.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_12.jpg",
        "Style": "scandinavian",
        "Generated Title": "Serene Minimalist Bathroom with Earthy Tones and Black Accents",
        "Generated Description": "This modern minimalist bathroom exudes a calming atmosphere with its palette of earthy neutrals, featuring large-format beige and greige tiles on the walls—some in a subtle herringbone pattern—paired with a lighter floor and a natural wood floating vanity. The clean design is accented by sleek matte black fixtures, including a frameless glass shower enclosure and contemporary cylindrical spotlights, alongside crisp white ceramic elements like the wall-mounted toilet and bowl sink, creating a sophisticated and functional space.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_12.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_68.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_68.jpg",
        "Style": "scandinavian",
        "Generated Title": "Soft Glow, Clean Lines: Contemporary Bathroom Sanctuary",
        "Generated Description": "This modern minimalist bathroom features a serene design characterized by warm, earthy neutral colors and clean lines. Vertical beige ceramic tiles complement a matte concrete-like vanity and integrated sink, while two captivating clear glass spherical pendant lights with brass accents emit a soft, warm glow. A wall-mounted brass faucet and a large simple mirror complete this contemporary, tranquil space, emphasizing natural materials and sophisticated simplicity.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_68.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_84.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_84.jpg",
        "Style": "scandinavian",
        "Generated Title": "Serene Spa Bathroom: Rustic Textures, Earthy Hues",
        "Generated Description": "This tranquil bathroom embodies a minimalist, bohemian, and Wabi-sabi style, featuring a cohesive palette of warm earthy tones like beige, cream, and sand. Materials include textured plaster walls, a raw-cut natural stone vanity, a smooth white ceramic vessel sink, and organic accents such as a woven basket, a jute rug, and delicate pampas grass. Soft, diffused natural light from a window combines with a spherical wooden pendant lamp and a subtle candle flame to create a serene, spa-like ambiance that emphasizes natural textures and a calming atmosphere.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_84.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_29.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_29.jpg",
        "Style": "scandinavian",
        "Generated Title": "Sleek Modern Bathroom: Wood, Stone, and Backlit Elegance",
        "Generated Description": "This contemporary bathroom showcases a luxurious blend of natural textures and modern elements. The shower wall features elegant vertical wooden slats paired with a light stone-effect floor and vanity counter, while contrasting dark gray concrete basin sinks and matte black fixtures add a sophisticated edge. Two oval, backlit mirrors cast a warm, ambient glow, defining a minimalist yet inviting spa-like design characterized by clean lines and a sophisticated neutral color palette.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_29.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_82.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_82.jpg",
        "Style": "scandinavian",
        "Generated Title": "Sleek Minimalist Bathroom Design with Wood Accents",
        "Generated Description": "This modern minimalist bathroom features a harmonious blend of light-toned speckled terrazzo-like material on the walls and floor, complemented by a light wood floating vanity with a pristine white solid surface countertop and sink. Subtle illumination comes from recessed ceiling spotlights and a captivating LED strip light framing the mirror, accentuating the clean lines, dark metal fixtures, and the overall serene and highly functional design.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_82.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_79.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_79.jpg",
        "Style": "scandinavian",
        "Generated Title": "Spacious Minimalist Bathroom Bathed in Natural Light",
        "Generated Description": "This modern, minimalist bathroom embraces a natural aesthetic with its dominant use of light wood for cabinetry, the integrated bathtub surround, and a small side table, complemented by crisp white walls, a contrasting black vanity countertop, and a circular gold-framed mirror. Abundant natural light pours through large wooden-framed windows, casting warm sunbeams across the light-toned floor and creating a vibrant, airy atmosphere, supplemented by two elegant wall-mounted sconces, all contributing to a serene, spa-like sanctuary that emphasizes clean lines and a profound connection to the outdoors.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_79.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_18.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_18.jpg",
        "Style": "scandinavian",
        "Generated Title": "Sleek Spa-Like Bathroom: Minimalist Design, Natural Light",
        "Generated Description": "This contemporary minimalist bathroom features a tranquil palette of light beige/greige tiles covering the walls and floor, complemented by a warm light wood floating vanity and subtle matte black fixtures. A frameless glass panel creates an open shower space, while recessed ceiling lights and a large horizontal window provide ample illumination. The overall design emphasizes clean lines, natural materials, and a cohesive color scheme to create a serene, uncluttered oasis.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_18.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_40.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_40.jpg",
        "Style": "scandinavian",
        "Generated Title": "Serene Wood and Water Modern Bathroom Sanctuary",
        "Generated Description": "This luxurious, modern bathroom embodies a calming, minimalist style with strong Japanese influences, featuring extensive use of light-toned wood on walls, slatted ceilings, and floating countertops, contrasted with light grey stone sinks and white decorative pebbles. Abundant natural light from large windows is beautifully complemented by warm, subtle recessed strip lighting under the vanities and gentle overhead illumination. The design incorporates a central reflective water feature with wooden stepping stones and a live plant, creating a spa-like retreat with a harmonious natural color palette.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_40.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_14.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_14.jpg",
        "Style": "scandinavian",
        "Generated Title": "Serene White Bathroom with Natural Wood Vanity & Sleek Design",
        "Generated Description": "This bright and modern minimalist bathroom features a predominantly white color palette, with walls adorned in crisp white subway tiles and smooth paint, complemented by light-toned flooring. A natural wood floating vanity introduces warmth, while matte black fixtures provide a sleek contrast against the white ceramic vessel sink and wall-mounted toilet. Strategic lighting includes recessed ceiling spotlights and a hidden LED strip above the large frameless mirror, casting a soft, inviting glow over the clean lines and contemporary design, creating an overall serene and highly functional aesthetic.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_14.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_35.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_35.jpg",
        "Style": "scandinavian",
        "Generated Title": "Tranquil Modern Bathroom: Natural Hues and Ambient Lighting",
        "Generated Description": "This modern, minimalist bathroom design exudes a tranquil, spa-like ambiance with its warm neutral palette and natural materials. Materials include smooth cream walls, light wooden slat panels, glass shower partitions, a freestanding white oval tub, and a unique river stone floor accent around the tub. Ambient lighting from recessed ceiling spots, hidden LED strips, and elegant globe pendants illuminates the space, highlighting the clean lines and creating a serene retreat.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_35.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_37.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_37.jpg",
        "Style": "scandinavian",
        "Generated Title": "Modern Serenity: Warm Tones and Clean Design",
        "Generated Description": "This contemporary bathroom showcases a serene design featuring warm, neutral materials like light beige wall tiles and a rich, dark wood floating vanity topped with a white vessel sink and a black faucet. The space is elegantly defined by a black-framed glass shower partition and a round mirror, while the ceiling's extensive cove lighting bathes the room in a soft, diffused warm glow. This minimalist style, characterized by clean lines and an earthy color palette, creates a functional yet inviting retreat.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_37.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_21.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_21.jpg",
        "Style": "scandinavian",
        "Generated Title": "Serene Japandi Bathroom Oasis with Natural Light",
        "Generated Description": "This minimalist bathroom showcases a serene design, emphasizing natural materials and a calming color palette. It features a long, light wooden vanity with two circular beige basin sinks, complemented by matte grey tile walls and warm wood paneling. Overhead, three slender pendant lights provide ambient illumination, enhanced by abundant natural light from a large window revealing lush greenery, creating a tranquil, spa-like atmosphere with its modern, organic style and earthy tones.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_21.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_19.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_19.jpg",
        "Style": "scandinavian",
        "Generated Title": "Earthy Tones, Natural Textures: A Serene Bathroom Retreat",
        "Generated Description": "This serene bathroom showcases a minimalist, spa-like design, meticulously crafted with natural materials and a warm, neutral color palette. The walls feature a light, textured plaster or concrete, beautifully paired with rich natural wood used for the door, slatted shower floor, and a multi-shelved storage unit, partly obscured by a frosted panel door. Warm brass-toned fixtures, including a rainfall showerhead and a soft recessed ceiling spotlight, provide inviting illumination and a touch of elegance, completing the organic and calming aesthetic.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_19.jpg"
    },
    {
        "File Name": "bathroom_scandinavian_25.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\scandinavian\\images\\bathroom_scandinavian_25.jpg",
        "Style": "scandinavian",
        "Generated Title": "Zen Modern Bathroom: Natural Materials and Serene Sunlight",
        "Generated Description": "This elegant, modern bathroom exudes a serene Japandi style, featuring a harmonious blend of natural materials such as light wood slat ceiling and shower walls, textured concrete, and white porcelain fixtures. The color palette emphasizes warm earth tones of beige, gray, and brown, accented by sleek black metal and a vibrant green plant. Strong natural sunlight streams in, casting beautiful shadows and enhancing the tranquil ambiance, complementing the subtle recessed lighting, all contributing to a luxurious and minimalist sanctuary with an open, airy design.",
        "file_url": "/static/scandinavian/images/bathroom_scandinavian_25.jpg"
    },
    {
        "File Name": "bathroom_industrial_69.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_69.jpg",
        "Style": "industrial",
        "Generated Title": "Sleek Grey Concrete Shower: Modern Industrial Oasis",
        "Generated Description": "This minimalist shower design features a modern industrial aesthetic, predominantly using raw concrete or a similar textured grey finish for all walls and the floor, creating a cohesive monochromatic palette. Matte black fixtures, including a ceiling-mounted rain shower and handheld spray, provide a sleek contrast, while integrated LED strip lighting under a recess casts a soft, warm glow that complements the natural light from the side window. The overall design emphasizes clean lines, functional simplicity, and the beauty of textured surfaces for a contemporary and serene bathing experience.",
        "file_url": "/static/industrial/images/bathroom_industrial_69.jpg"
    },
    {
        "File Name": "bathroom_industrial_40.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_40.jpg",
        "Style": "industrial",
        "Generated Title": "Industrial Concrete Bathroom Featuring Minimalist Design and Wood Accents",
        "Generated Description": "This minimalist industrial bathroom features textured grey concrete walls and flooring, creating a stark yet sophisticated monochromatic palette. A single exposed Edison-style bulb casts a warm, focused glow, beautifully contrasting with the warm wooden mirror frame, ladder-style shelving unit, and small stool, which introduce natural elements and a touch of warmth to the raw, unfinished aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_40.jpg"
    },
    {
        "File Name": "bathroom_industrial_44.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_44.jpg",
        "Style": "industrial",
        "Generated Title": "Warm Industrial Spa Retreat: Concrete, Wood, and Soft Light",
        "Generated Description": "This luxurious bathroom embodies a sophisticated blend of industrial and rustic styles, prominently featuring raw, textured concrete walls and large format floor tiles in varying shades of gray. A striking live-edge wooden vanity, alongside warm amber-toned pendant lights and subtle recessed illumination, introduces rich browns and inviting glows. The overall design emphasizes natural materials and strategic lighting to achieve a serene, modern, and undeniably cozy spa-like aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_44.jpg"
    },
    {
        "File Name": "bathroom_industrial_95.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_95.jpg",
        "Style": "industrial",
        "Generated Title": "Organic Modern Bathroom: Stone, Wood, and Ambient Light",
        "Generated Description": "This modern luxury bathroom showcases a sophisticated blend of natural materials, featuring dark textured stone walls and a floating warm wooden vanity with integrated dual sinks and matte black fixtures. An organically shaped, backlit mirror and a stylish brass pendant light illuminate the space, complemented by a vertical LED strip and a vibrant green plant, creating a serene, spa-like ambiance with deep grays, rich browns, and elegant lighting.",
        "file_url": "/static/industrial/images/bathroom_industrial_95.jpg"
    },
    {
        "File Name": "bathroom_industrial_11.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_11.jpg",
        "Style": "industrial",
        "Generated Title": "Dark Stone and Brass Bathroom Sanctuary",
        "Generated Description": "This sophisticated bathroom design features a moody aesthetic, combining raw, dark textured materials like the rough-hewn stone vessel sink and charcoal grey walls with warm brass fixtures and a circular mirror. A minimalist brass pendant light with a spherical bulb illuminates the space, creating a refined ambiance. Earthy accents, including dried botanicals in a black vase and a wooden brush, complement the industrial-inspired style, enhancing the rich interplay of textures and muted colors.",
        "file_url": "/static/industrial/images/bathroom_industrial_11.jpg"
    },
    {
        "File Name": "bathroom_industrial_9.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_9.jpg",
        "Style": "industrial",
        "Generated Title": "Modern Industrial Bathroom: Concrete, Brick, and Warm Light",
        "Generated Description": "This modern industrial bathroom showcases a sophisticated blend of dark grey concrete walls and flooring, a warm brick accent wall, and a dark wood vanity, all tied together with exposed black metal piping and fixtures. Warm Edison-style bulbs cast an inviting glow, while natural light from a skylight illuminates the minimalist yet robust design, emphasizing raw materials and functional elegance for a true loft-inspired aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_9.jpg"
    },
    {
        "File Name": "bathroom_industrial_67.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_67.jpg",
        "Style": "industrial",
        "Generated Title": "Sleek Dark Gray Minimalist Bathroom Design",
        "Generated Description": "This modern minimalist bathroom showcases a sophisticated monochromatic design, predominantly featuring dark grey large-format tiles on the walls and floor, a textured concrete-look ceiling, and a dark vanity with a crisp white basin. Strategic track lighting casts focused beams, highlighting the clean lines of the white ceramic fixtures and the elegant texture of the materials, while a subtle natural accent of dried pampas grass adds warmth to the industrial-chic aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_67.jpg"
    },
    {
        "File Name": "bathroom_industrial_27.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_27.jpg",
        "Style": "industrial",
        "Generated Title": "Luxurious Modern Bathroom: Dark Tones, Warm Ambient Glow",
        "Generated Description": "This sophisticated modern bathroom features a sleek design dominated by dark gray, textured large-format tiles on the walls and floor, complemented by a matte black floating vanity and fixtures. Warm, ambient lighting is provided by recessed ceiling spotlights and two striking industrial-style pendant lights with visible filaments and amber glass shades, casting a cozy glow that highlights the rich textures and deep charcoal colors. The minimalist aesthetic, combined with elegant materials and strategic illumination, creates a luxurious and inviting atmosphere.",
        "file_url": "/static/industrial/images/bathroom_industrial_27.jpg"
    },
    {
        "File Name": "bathroom_industrial_42.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_42.jpg",
        "Style": "industrial",
        "Generated Title": "Contemporary Dark Elegance with Warm Wood and Brass Accents",
        "Generated Description": "This modern bathroom showcases a sophisticated and moody aesthetic with dark, textured charcoal-grey wall tiles. A floating dark wood vanity, topped with a white circular basin, is elegantly flanked by a gold-framed round mirror and two brass pendant lights that cast a warm, inviting glow. The design is completed by a striking herringbone pattern wood floor, offering a rich textural and color contrast, alongside a wall-mounted toilet and open shelving that maintain a sleek, space-efficient appeal.",
        "file_url": "/static/industrial/images/bathroom_industrial_42.jpg"
    },
    {
        "File Name": "bathroom_industrial_32.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_32.jpg",
        "Style": "industrial",
        "Generated Title": "High-Contrast Industrial Chic Powder Room",
        "Generated Description": "This dramatic powder room showcases a sophisticated design, combining glossy black subway tiles on the walls with a striking black and white geometric patterned floor. Warm, industrial-style pendant lights with exposed bulbs cast a soft glow on the dark wood ceiling and vanity, highlighting the framed artwork and contributing to the luxurious, moody ambiance. The high-contrast palette of predominantly black and white, softened by rich wooden elements and warm lighting, creates an intimate space with a distinct vintage industrial aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_32.jpg"
    },
    {
        "File Name": "bathroom_industrial_2.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_2.jpg",
        "Style": "industrial",
        "Generated Title": "Modern Emerald Washroom with Distorted Reflective Ceiling",
        "Generated Description": "This stylish modern washroom features dark emerald-green subway tiles on the walls, a striking textured reflective ceiling, and a classic black and white checkered floor. The vanity area showcases a dark marble countertop with white vessel sinks and elegant gold-finished faucets, complemented by large backlit mirrors that provide both functional lighting and an ambient glow. This design creates a sophisticated and high-contrast space, blending industrial chic with luxurious elements for a unique boutique aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_2.jpg"
    },
    {
        "File Name": "bathroom_industrial_66.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_66.jpg",
        "Style": "industrial",
        "Generated Title": "Organic Modern Bathroom: Stone, Wood, and Light",
        "Generated Description": "This organic modern bathroom features a harmonious blend of natural and refined materials, including a prominent rough-hewn stone accent wall, large format grey ceramic tiles, and a warm wooden floating vanity with a matching floor. The lighting scheme incorporates a striking backlit mirror and subtle recessed ceiling lights, casting a soft, inviting glow over the predominantly cool grey palette punctuated by natural wood tones and sleek black matte fixtures. Its minimalist yet textural design creates a sophisticated, spa-like sanctuary.",
        "file_url": "/static/industrial/images/bathroom_industrial_66.jpg"
    },
    {
        "File Name": "bathroom_industrial_49.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_49.jpg",
        "Style": "industrial",
        "Generated Title": "Sleek Grey and Black Industrial Modern Bathroom Design",
        "Generated Description": "This compact, industrial-modern bathroom features a minimalist monochromatic palette of cool grey microcement walls, a matching bowl sink, and striking matte black fixtures. A raw wooden vanity provides a warm, natural contrast, complemented by a distinctive black and white patterned tile floor and an open shower design with a grid-paneled glass partition. Lighting includes a sleek black adjustable wall sconce and a dome ceiling light with an exposed bulb, all contributing to the clean, urban-chic aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_49.jpg"
    },
    {
        "File Name": "bathroom_industrial_33.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_33.jpg",
        "Style": "industrial",
        "Generated Title": "Sleek Modern Bathroom with Warm Ambient LED Lighting",
        "Generated Description": "This sleek, modern bathroom showcases a sophisticated palette of greys and blacks, featuring large-format concrete-look tiles on the walls and a lighter tiled floor, complemented by a matte black floating vanity, bowl sink, and framed mirror. Integrated warm amber LED strip lighting creates a dramatic ambiance under the vanity, behind the mirror, and along the shower base, while recessed spotlights provide general illumination, enhancing the minimalist and luxurious spa-like design.",
        "file_url": "/static/industrial/images/bathroom_industrial_33.jpg"
    },
    {
        "File Name": "bathroom_industrial_94.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_94.jpg",
        "Style": "industrial",
        "Generated Title": "Raw Concrete and Steel: Industrial Urban Bathroom",
        "Generated Description": "This striking industrial-chic bathroom features raw, textured concrete walls in deep charcoal and muted grey tones, contrasted by sleek stainless steel fixtures for the bathtub and wall-mounted sink, creating a distinctly urban and minimalist aesthetic. Exposed metallic piping and a rustic wooden plank ceiling contribute to the raw, unfinished design, while deliberate lighting, featuring a warm, single exposed bulb by the mirror and a cooler ceiling light, highlights the room's moody ambiance and the unique, hand-painted \"YOU LOOK FINE\" message on the wall.",
        "file_url": "/static/industrial/images/bathroom_industrial_94.jpg"
    },
    {
        "File Name": "bathroom_industrial_39.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_39.jpg",
        "Style": "industrial",
        "Generated Title": "Oxidized Chic Shower: Textured Wall, Minimalist Fixtures, Modern Earthiness",
        "Generated Description": "This image captures a modern industrial-chic shower space, characterized by a striking wall of large format tiles with a rich, oxidized metallic texture in deep bronzes, earthy browns, and charcoal greys. Complementing this raw aesthetic is a sleek, minimalist black shower hose featuring a brushed copper accent handle, alongside dark apothecary-style bottles. Soft, diffused natural light illuminates the scene, highlighting the varied textures and creating a serene, sophisticated design that subtly opens to a neutral-toned, minimalist bedroom beyond.",
        "file_url": "/static/industrial/images/bathroom_industrial_39.jpg"
    },
    {
        "File Name": "bathroom_industrial_146.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_146.jpg",
        "Style": "industrial",
        "Generated Title": "Crimson Glow in an Edgy Industrial Washroom",
        "Generated Description": "This image captures a striking industrial-style public washroom, characterized by its raw, unfinished materials like exposed brick walls, concrete ceilings, and a matching concrete floor. The space is dramatically lit by vibrant red LED strip lighting along the ceiling, which casts an intense crimson glow and reflects vividly off the sleek matte black ceramic toilets and basin. Additional industrial-style wall sconces and pendant lights provide warm, functional illumination, enhancing the overall design that masterfully blends rugged textures with modern utilitarian elements to create a moody and uniquely edgy environment.",
        "file_url": "/static/industrial/images/bathroom_industrial_146.jpg"
    },
    {
        "File Name": "bathroom_industrial_152.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_152.jpg",
        "Style": "industrial",
        "Generated Title": "Moody Modern Spa Bathroom with Amber Glow",
        "Generated Description": "This luxurious modern bathroom features a dramatic design with dark charcoal and deep brown textured tiles covering the walls and floor, complemented by a sleek, floating dark grey concrete vanity. An exquisite array of amber-toned, spherical glass pendant lights illuminates the space, enhanced by warm LED strip lighting beneath the vanity and mirror shelf, creating a moody, sophisticated, and spa-like ambiance. Matte black fixtures and minimalist accessories complete the industrial-chic aesthetic, contrasting beautifully with the inviting glow.",
        "file_url": "/static/industrial/images/bathroom_industrial_152.jpg"
    },
    {
        "File Name": "bathroom_industrial_93.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_93.jpg",
        "Style": "industrial",
        "Generated Title": "Sleek Grey Sanctuary: Modern Bathroom with Soft Illumination",
        "Generated Description": "This modern minimalist bathroom features a serene design dominated by cool grey tones from the textured concrete-like walls and integrated floating countertop. A pristine white oval vessel sink with dark metal fixtures creates a striking contrast against the muted backdrop. The space is illuminated by warm, soft LED lighting emanating from a backlit mirror and sleek vertical sconces, enhancing the tranquil, spa-like atmosphere, further complemented by natural wood shelving and clean, uncluttered lines.",
        "file_url": "/static/industrial/images/bathroom_industrial_93.jpg"
    },
    {
        "File Name": "bathroom_industrial_3.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_3.jpg",
        "Style": "industrial",
        "Generated Title": "Industrial Chic Bathroom: Concrete, Wood, and Warm Lights",
        "Generated Description": "This contemporary bathroom showcases an industrial chic design, masterfully blending raw concrete walls and flooring with warm vertical wood paneling and cabinetry. The space is illuminated by a mix of recessed ceiling spotlights, sleek wall-mounted sconces, and distinctive pendant lights, all casting a soft, warm ambient glow that highlights the muted gray and earthy brown color palette. The overall design features a minimalist glass shower, a floating vanity with open metal and wood shelving, and a wall-mounted toilet, creating a sophisticated yet rugged urban aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_3.jpg"
    },
    {
        "File Name": "bathroom_industrial_10.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_10.jpg",
        "Style": "industrial",
        "Generated Title": "Industrial Chic Bathroom: Textured Walls and Warm Lights",
        "Generated Description": "This image presents a stunning rustic industrial bathroom vanity, characterized by a sophisticated interplay of raw textures and warm lighting. The walls feature dark, textured tiles with an oxidized metallic finish in deep blues, grays, and rusty browns, beautifully illuminated by two brass pendant lights and a warm candle glow. A dark, hammered metal bowl sink rests on a porous concrete countertop, complemented by a wall-mounted dark bronze faucet, a round black-framed mirror, and a rustic wooden vanity, creating a cohesive design rich in earthy colors and an inviting, moody style.",
        "file_url": "/static/industrial/images/bathroom_industrial_10.jpg"
    },
    {
        "File Name": "bathroom_industrial_41.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_41.jpg",
        "Style": "industrial",
        "Generated Title": "Modern Bathroom with Bold Navy and Coral Color Scheme",
        "Generated Description": "This contemporary bathroom boasts a striking two-tone design, featuring matte navy blue walls and cabinetry contrasted vibrantly with coral-pink ceramic tiles in the shower, a matching vessel sink, countertop, and a wall-mounted toilet. Dark wood plank flooring grounds the sophisticated palette, while recessed ceiling spotlights and an amber LED strip light above the shower provide warm, dramatic illumination. The minimalist style is evident in the clean lines, circular mirror, and functional layout, creating a luxurious and distinctly modern space.",
        "file_url": "/static/industrial/images/bathroom_industrial_41.jpg"
    },
    {
        "File Name": "bathroom_industrial_38.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_38.jpg",
        "Style": "industrial",
        "Generated Title": "Urban Industrial Bathroom: Rustic Wood, Brick, and Warm Glow",
        "Generated Description": "This inviting bathroom design beautifully marries industrial and rustic styles, featuring rough exposed brick walls, raw concrete elements, and warm, aged wooden plank flooring. The space is illuminated by several exposed Edison bulb pendant lights that cast a soft, golden glow, highlighting the utilitarian black metal piping, simple shelving, and a grey basin sink. The overall design emphasizes natural textures and a rich, earthy color palette, creating a chic yet rugged aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_38.jpg"
    },
    {
        "File Name": "bathroom_industrial_5.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_5.jpg",
        "Style": "industrial",
        "Generated Title": "Sleek Dark Bathroom Oasis with Warm Gold Details",
        "Generated Description": "This luxurious modern bathroom features a sophisticated design, utilizing dark, veined marble on the walls and shower area, complemented by a matte black integrated sink with a subtle white countertop edge. Warm brass fixtures, including the showerhead and controls, provide opulent accents, beautifully illuminated by recessed ceiling spotlights and the soft, inviting glow of a candlelight. The overall style is minimalist and contemporary, creating a serene, spa-like atmosphere with its dramatic lighting and rich, dark color palette.",
        "file_url": "/static/industrial/images/bathroom_industrial_5.jpg"
    },
    {
        "File Name": "bathroom_industrial_28.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_28.jpg",
        "Style": "industrial",
        "Generated Title": "Modern Industrial Bathroom Featuring Rustic Metal Walls",
        "Generated Description": "This striking bathroom showcases a modern industrial style, characterized by walls and floors clad in large format tiles with a heavily textured, oxidized copper and rustic brown finish, complemented by a dark wood vanity, a bronze vessel sink, and sleek matte black fixtures. Strategically placed lighting, including ceiling spotlights and a warm LED strip in the shower niche, accentuates the rich textures and provides a luxurious glow, creating a cohesive, moody, and sophisticated overall design.",
        "file_url": "/static/industrial/images/bathroom_industrial_28.jpg"
    },
    {
        "File Name": "bathroom_industrial_36.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_36.jpg",
        "Style": "industrial",
        "Generated Title": "Sleek Grey Sanctuary: Modern Industrial Bathroom Design",
        "Generated Description": "This contemporary bathroom showcases a sleek, minimalist design dominated by a monochromatic palette of dark grey and black. The walls and floor are finished in a smooth, matte concrete or microcement material, providing a uniform, industrial texture. Natural light floods the space from a prominent rectangular skylight, creating a stark contrast with the muted tones, complemented by black metal fixtures, a glass shower enclosure, and a matte dark grey toilet, completing a sophisticated, uncluttered aesthetic.",
        "file_url": "/static/industrial/images/bathroom_industrial_36.jpg"
    },
    {
        "File Name": "bathroom_industrial_48.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_48.jpg",
        "Style": "industrial",
        "Generated Title": "Earthy Industrial Bathroom Retreat",
        "Generated Description": "This sophisticated bathroom blends industrial and wabi-sabi styles, utilizing raw concrete walls and flooring, dark reclaimed wood accents on the ceiling and vanity, and sleek black metal frames for the mirror and shower. A warm, earthy color palette of grays and deep browns is illuminated by strategically placed lighting, including dimmable under-mirror strips, exposed Edison bulb sconces, and subtle ceiling spotlights, creating an intimate and textured ambiance. The design is completed with a bowl-style sink and minimalist accessories, emphasizing natural materials and understated luxury.",
        "file_url": "/static/industrial/images/bathroom_industrial_48.jpg"
    },
    {
        "File Name": "bathroom_industrial_15.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_15.jpg",
        "Style": "industrial",
        "Generated Title": "Tranquil Concrete and Wood Spa Retreat",
        "Generated Description": "This modern industrial bathroom sanctuary harmoniously blends raw concrete walls and floors with warm natural wood elements, including a slatted ceiling and cantilevered vanity. A serene, light beige oval freestanding tub and matching vessel sink are complemented by sleek black matte fixtures and a backlit oval mirror. The minimalist design emphasizes earthy tones, organic textures, and varied lighting from an industrial sconce and a large grid-paneled window, creating a tranquil and visually balanced spa-like retreat.",
        "file_url": "/static/industrial/images/bathroom_industrial_15.jpg"
    },
    {
        "File Name": "bathroom_industrial_100.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_100.jpg",
        "Style": "industrial",
        "Generated Title": "Sleek Black Marble Vanity with Industrial Chic Accents",
        "Generated Description": "This contemporary bathroom boasts a luxurious, minimalist design dominated by a palette of rich dark tones. It features a stunning black marble countertop with striking golden veining, contrasted by white circular vessel sinks and sleek matte black wall-mounted faucets. The walls are clad in dark, textured tiles, complemented by elegant black-framed mirrors and unique pendant lights that cast a warm glow, all contributing to a sophisticated and slightly industrial-chic ambiance.",
        "file_url": "/static/industrial/images/bathroom_industrial_100.jpg"
    },
    {
        "File Name": "bathroom_industrial_37.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\industrial\\images\\bathroom_industrial_37.jpg",
        "Style": "industrial",
        "Generated Title": "Earthy Modern Bathroom: Stone, Wood, and Warm Light",
        "Generated Description": "This inviting bathroom showcases a blend of earthy modern and tropical rustic styles, dominated by dark grey and brown tones with natural wood accents. Textured horizontal tiles cover the walls, complementing the light stone vanity counter and a striking natural stone vessel sink. Warm lighting emanates from a prominent woven pendant lamp and subtle recessed fixtures, enhancing the rich textures of the natural stick vanity cabinet and providing a cozy, organically designed ambiance.",
        "file_url": "/static/industrial/images/bathroom_industrial_37.jpg"
    },
    {
        "File Name": "bathroom_modern_59.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_59.jpg",
        "Style": "modern",
        "Generated Title": "Luxurious Modern Bathroom Featuring Wood and Golden Glow",
        "Generated Description": "This luxurious modern bathroom features a sophisticated design combining warm neutral tones from light wood-look wall and floor tiles with a rich, dark brown wood panel accent wall patterned in a striking chevron with vertical brass inlays. The space is elegantly illuminated by a large, organic-shaped mirror with integrated LED backlighting and three golden-fixture pendant lights, creating a warm, contemporary, and spa-like atmosphere around the floating vanity with a vessel sink and minimalist toilet.",
        "file_url": "/static/modern/images/bathroom_modern_59.jpg"
    },
    {
        "File Name": "bathroom_modern_42.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_42.jpg",
        "Style": "modern",
        "Generated Title": "Serene Industrial Chic Bathroom Retreat",
        "Generated Description": "This serene bathroom blends industrial chic with natural minimalism, featuring rough concrete walls and light stone flooring complemented by a slatted wooden ceiling and various wooden accents. Natural light floods the space through a large grid window, balanced by the soft glow from a backlit mirror and a stylish wall sconce. The design emphasizes earthy tones of grey, brown, and beige, utilizing materials like wood, concrete, and ceramic to create a tranquil, spa-like atmosphere around the focal point of a smooth, oval freestanding tub.",
        "file_url": "/static/modern/images/bathroom_modern_42.jpg"
    },
    {
        "File Name": "bathroom_modern_69.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_69.jpg",
        "Style": "modern",
        "Generated Title": "Organic Modern Bathroom: Earthy Hues, Sculptural Mirror",
        "Generated Description": "This contemporary bathroom features a minimalist design, characterized by light beige walls and a floating double vanity made from a matte, light-toned stone composite, accented with sleek matte black faucets. A large, frameless mirror with an irregular organic shape serves as a striking focal point, reflecting the serene neutral palette. Warm LED strip lighting beneath the vanity and open wooden shelf creates an inviting ambiance, complementing the subtle overhead spotlights and contributing to the overall modern, spa-like style that blends clean lines with natural textures and earthy hues.",
        "file_url": "/static/modern/images/bathroom_modern_69.jpg"
    },
    {
        "File Name": "bathroom_modern_76.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_76.jpg",
        "Style": "modern",
        "Generated Title": "Elegant Contemporary Bathroom with Layered Lighting and Marble Accents",
        "Generated Description": "This modern luxury bathroom showcases a sophisticated design, blending a light neutral wall and a warm wooden floating vanity with a dramatic dark grey marble slab on the opposing wall. Integrated LED halo lights frame the three circular mirrors, complemented by warm LED strip lighting under the vanity and a unique gold and white artistic pendant light, creating a spa-like ambiance. The contemporary style is defined by clean lines, a boat-shaped white ceramic sink, and a serene color palette of creams, greys, and browns, softly illuminated by the layered lighting and scattered candles.",
        "file_url": "/static/modern/images/bathroom_modern_76.jpg"
    },
    {
        "File Name": "bathroom_modern_105.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_105.jpg",
        "Style": "modern",
        "Generated Title": "High-Contrast Modern Bathroom: Marble, Wood, and Gold",
        "Generated Description": "This luxurious modern bathroom features a high-contrast design, blending rich materials and sophisticated lighting. A striking black marble wall with white veining provides a dramatic backdrop for an asymmetrical, multi-panel mirror framed in warm gold, complemented by a floating vanity crafted from warm wood and topped with a crisp white counter and black basin. Gold pendant lights with spherical white diffusers illuminate the space, accentuating the contemporary style and opulent color palette of black, white, wood tones, and metallic gold accents.",
        "file_url": "/static/modern/images/bathroom_modern_105.jpg"
    },
    {
        "File Name": "bathroom_modern_31.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_31.jpg",
        "Style": "modern",
        "Generated Title": "Warm Neutral Bathroom with Backlit Circular Mirror",
        "Generated Description": "This serene, modern bathroom showcases a harmonious, neutral color palette centered around a large circular backlit mirror and a sleek, floating double vanity. Materials include textured beige plaster walls, a light wood or microcement vanity with dark, irregular stone vessel sinks, and matte black fixtures. The ambient backlighting of the mirror creates a soft glow, complementing the indirect general illumination to achieve a tranquil, spa-like atmosphere, further enhanced by minimalist decor and neatly folded towels.",
        "file_url": "/static/modern/images/bathroom_modern_31.jpg"
    },
    {
        "File Name": "bathroom_modern_64.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_64.jpg",
        "Style": "modern",
        "Generated Title": "Sleek Modern Bathroom: Dark Tones and Radiant Curves",
        "Generated Description": "This modern and luxurious bathroom showcases a sophisticated design dominated by dark grays and charcoal tones, softened by warm dark wood accents on the floating vanity. The ambiance is significantly enhanced by a large, curved mirror featuring integrated warm LED backlighting, echoed by a corresponding LED strip beneath the vanity, creating a cohesive and inviting glow. Materials include large format dark gray tiles, a matte black vessel sink, and sleek black fixtures, all contributing to a minimalist yet richly textured contemporary aesthetic.",
        "file_url": "/static/modern/images/bathroom_modern_64.jpg"
    },
    {
        "File Name": "bathroom_modern_86.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_86.jpg",
        "Style": "modern",
        "Generated Title": "Modern Marble Bathroom: Black, White, and Gold Elegance",
        "Generated Description": "This luxurious modern bathroom showcases a dramatic monochromatic design, utilizing high-contrast black and white marble tiling extensively on the walls and floor, complemented by sleek black fixtures and a richly textured fluted vanity. The space is illuminated by subtle recessed ceiling lights and a striking multi-arm gold pendant fixture that hangs elegantly above the black vessel sink, adding a glamorous touch. Overall, the design blends minimalist aesthetics with opulent materials and metallic accents to create a sophisticated, uncluttered, and highly stylized environment.",
        "file_url": "/static/modern/images/bathroom_modern_86.jpg"
    },
    {
        "File Name": "bathroom_modern_88.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_88.jpg",
        "Style": "modern",
        "Generated Title": "Luxurious Marble and Wood Bathroom Retreat",
        "Generated Description": "This luxurious modern bathroom showcases a sophisticated design with a palette of warm neutrals, featuring veined grey and beige marble walls and floors. A floating wooden vanity with a textured ribbed base and natural wood countertop introduces warmth, perfectly paired with a pristine white circular basin and open display shelving. The space is expertly illuminated by layered ambient lighting, including a prominent LED-backlit mirror, integrated shelf lighting, under-vanity glow, and recessed ceiling spotlights, creating a serene, spa-like atmosphere with clean lines and natural textures.",
        "file_url": "/static/modern/images/bathroom_modern_88.jpg"
    },
    {
        "File Name": "bathroom_modern_101.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_101.jpg",
        "Style": "modern",
        "Generated Title": "Sleek Marble Spa Bathroom with Dramatic Contrast",
        "Generated Description": "This luxurious and modern bathroom features a sophisticated monochrome design, showcasing striking white marble-look tiles with dramatic grey veining on the walls, complemented by a dark grey matte floor and ceiling. Matte black fixtures, including sleek dual-sink faucets, the shower frame, and oval mirrors, provide sharp contemporary contrast, while a combination of recessed track lighting, subtle LED strips in the shower, and abundant natural light illuminates the expansive, spa-like space.",
        "file_url": "/static/modern/images/bathroom_modern_101.jpg"
    },
    {
        "File Name": "bathroom_modern_32.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_32.jpg",
        "Style": "modern",
        "Generated Title": "Warm Wood and Stone Bathroom Oasis with Ambient Light",
        "Generated Description": "This modern, minimalist bathroom design exudes a tranquil, spa-like ambiance through its predominant use of warm, earthy tones and natural materials like slatted wooden panels on the ceiling and vanity, concrete-like walls, and a pebble-inlaid shower floor. Subtle yet effective lighting, including recessed spotlights and hidden LED strip lights, bathes the space in a soft, inviting glow, highlighting the clean lines and creating a serene retreat with a biophilic touch from integrated greenery.",
        "file_url": "/static/modern/images/bathroom_modern_32.jpg"
    },
    {
        "File Name": "bathroom_modern_57.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_57.jpg",
        "Style": "modern",
        "Generated Title": "Sleek Marble Bathroom with Integrated Lighting",
        "Generated Description": "This luxurious modern bathroom features a sophisticated palette of white and grey marble, covering the floor, walls, and vanity countertop, creating a seamless and elegant aesthetic. Multiple integrated lighting elements, including a prominent backlit oval mirror, a spherical wall sconce, linear LEDs on the fluted wall panel, and illuminated shelving in the dark storage unit, create a layered and ambient glow. The design blends minimalist clean lines with rich textures and warm lighting accents, highlighting a floating vanity and a dark wood or panel storage solution for a chic, contemporary sanctuary.",
        "file_url": "/static/modern/images/bathroom_modern_57.jpg"
    },
    {
        "File Name": "bathroom_modern_35.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_35.jpg",
        "Style": "modern",
        "Generated Title": "Chic Neutral Bathroom with Organic Mirror and Ambient Glow",
        "Generated Description": "This luxurious, modern bathroom features a serene palette of warm beige and cream, utilizing large format marble-effect tiles on the walls and a ribbed paneling texture for visual interest behind the vanity and under the floating counter. The design is illuminated by soft, warm LED lighting from a unique organically shaped backlit mirror, integrated strips within arched and rectangular wall niches, and under the vanity, creating a sophisticated and spa-like ambiance. Polished brass fixtures add a touch of elegance to the minimalist and clean aesthetic.",
        "file_url": "/static/modern/images/bathroom_modern_35.jpg"
    },
    {
        "File Name": "bathroom_modern_77.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_77.jpg",
        "Style": "modern",
        "Generated Title": "Tranquil Modern Bathroom with Warm Stone and Ambient Light",
        "Generated Description": "This image showcases a tranquil, modern bathroom designed with a sophisticated, minimalist style. It features walls and floors clad in light beige natural stone tiles, complementing the sleek white floating vanity with a seamless countertop. Layered lighting, including recessed ceiling lights, elegant wall sconces flanking the mirror, and integrated LED strip lighting under the vanity and within the stylish recessed shelving, creates a warm and inviting spa-like ambiance, while the neutral palette of creams and beiges emphasizes clean lines and natural textures for a serene overall design.",
        "file_url": "/static/modern/images/bathroom_modern_77.jpg"
    },
    {
        "File Name": "bathroom_modern_107.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_107.jpg",
        "Style": "modern",
        "Generated Title": "Sophisticated Vanity with Backlit Crescent Mirror",
        "Generated Description": "This luxurious contemporary powder room boasts a dark grey veined stone floating vanity paired with a white ceramic vessel sink, set against light grey slatted walls and a captivating backlit crescent mirror. Gold wall-mounted faucets and sleek cylindrical pendant lights add warm metallic accents, while recessed ceiling lights and under-shelf strip lighting create a sophisticated, layered ambiance. The design is further enhanced by a striking black ceiling with gold trim and an intricate dark geometric screen, embodying an elegant modern aesthetic through its dominant grey, black, white, and gold color palette.",
        "file_url": "/static/modern/images/bathroom_modern_107.jpg"
    },
    {
        "File Name": "bathroom_modern_87.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_87.jpg",
        "Style": "modern",
        "Generated Title": "Elegant Modern Bathroom with Striking Marble Accents",
        "Generated Description": "This elegant modern bathroom showcases a luxurious design with walls and floors clad in beautiful light grey marble-look tiles featuring subtle veining. A dramatic dark brown and grey veined marble slab acts as a striking feature wall behind the white ceramic toilet, brilliantly illuminated by warm LED strip lighting that flanks it, alongside bright recessed ceiling spotlights. Polished gold accents, a light wood-toned recessed niche, and minimalist fixtures complete the opulent and sophisticated aesthetic.",
        "file_url": "/static/modern/images/bathroom_modern_87.jpg"
    },
    {
        "File Name": "bathroom_modern_80.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_80.jpg",
        "Style": "modern",
        "Generated Title": "Elegant Grey and Wood Modern Bathroom Oasis",
        "Generated Description": "This elegant modern bathroom showcases large format grey marble-effect tiles on the walls and warm fluted wood paneling with matching floating shelves, creating a sophisticated, spa-like ambiance. The design features a palette of cool greys and rich browns, accented by matte black fixtures and a crisp white vessel sink and toilet. Integrated LED strip lighting subtly highlights the mirror and shelves, providing a soft, warm glow that complements the recessed ceiling lights and sleek black pendant lights, creating a layered and inviting illumination.",
        "file_url": "/static/modern/images/bathroom_modern_80.jpg"
    },
    {
        "File Name": "bathroom_modern_70.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_70.jpg",
        "Style": "modern",
        "Generated Title": "Minimalist Bathroom Vanity: Modern Design, Radiant Lighting",
        "Generated Description": "This image showcases a minimalist and contemporary bathroom design featuring a floating vanity with a seamless white countertop and integrated sink, contrasted by dark gray cabinetry and a lower open shelf, all set against large format light gray walls. Illumination is a key design element, provided by a large round backlit mirror, integrated LED strips within recessed wall niches and under the lower shelf, complemented by two elegant warm-toned pendant lights. The overall color palette is a sophisticated blend of cool grays, crisp white, and matte black fixtures, enhanced by the inviting warm glow of the strategic lighting.",
        "file_url": "/static/modern/images/bathroom_modern_70.jpg"
    },
    {
        "File Name": "bathroom_modern_56.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_56.jpg",
        "Style": "modern",
        "Generated Title": "Sleek Contemporary Bathroom Design with Elegant Stone and Ambient Glow",
        "Generated Description": "This luxurious contemporary bathroom showcases a sophisticated design utilizing dark marble or large format stone tiles for the walls, floor, and vanity countertop, complemented by sleek glass for the shower enclosure. Warm ambient lighting emanates from recessed ceiling spotlights, striking vertical LED strips flanking the mirrors, and an inviting under-vanity glow, creating a serene atmosphere against the predominantly charcoal gray and black color palette, punctuated by white ceramic fixtures. The overall design features clean lines, a double vanity with integrated storage, a freestanding tub, and a spacious walk-in shower, offering a spa-like aesthetic.",
        "file_url": "/static/modern/images/bathroom_modern_56.jpg"
    },
    {
        "File Name": "bathroom_modern_81.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_81.jpg",
        "Style": "modern",
        "Generated Title": "Sophisticated Bathroom: Marble, Wood, and Ambient Glow",
        "Generated Description": "This luxurious and modern bathroom design artfully combines natural materials, featuring prominent grey and brown marble-effect wall tiles, rich dark wood paneling, and a striking white marble pedestal sink. The space is illuminated by a sophisticated multi-layered lighting scheme, including three warm pendant globe lights, back-lit irregular geometric mirrors acting as a focal point, and subtle LED strips under the vanity and along the floor. This harmonious blend of textures, warm light, and a refined neutral color palette with elegant gold accents creates an inviting and contemporary spa-like aesthetic.",
        "file_url": "/static/modern/images/bathroom_modern_81.jpg"
    },
    {
        "File Name": "bathroom_modern_85.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_85.jpg",
        "Style": "modern",
        "Generated Title": "Sleek Modern Bathroom: Organic Mirror's Warm LED Glow",
        "Generated Description": "This sophisticated modern bathroom features a palette of dark grays, evident in the large format wall tiles, solid surface countertop, and integrated washing machine, beautifully contrasted by warm natural wood accents in the slatted vanity and flooring. The minimalist design is elevated by an organically shaped, frameless mirror that serves as a striking focal point, illuminated by a warm LED backlight that casts a soft, ambient glow, highlighting the room's elegant textures and functional layout.",
        "file_url": "/static/modern/images/bathroom_modern_85.jpg"
    },
    {
        "File Name": "bathroom_modern_47.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_47.jpg",
        "Style": "modern",
        "Generated Title": "Sophisticated Marble and Copper Powder Room Design",
        "Generated Description": "This sophisticated contemporary bathroom showcases luxurious white marble with intricate dark veining across the walls, floor, and a sleek floating vanity, contrasted by a deep charcoal accent wall. A curated arrangement of round, copper-framed mirrors, including a distinctive split wood and mirror design, creates a striking focal point, complemented by a black vessel sink and coordinating metallic fixtures. Warm, ambient lighting from a multi-bulb pendant fixture and under-counter strips illuminates the rich textures and reflective surfaces, contributing to the room's elegant and spa-like overall design.",
        "file_url": "/static/modern/images/bathroom_modern_47.jpg"
    },
    {
        "File Name": "bathroom_modern_72.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_72.jpg",
        "Style": "modern",
        "Generated Title": "Luxurious Gray Marble Shower with Integrated Lighting",
        "Generated Description": "This sleek, modern shower features large format gray marble-look tiles with striking white veining throughout the walls and floor, extending to a built-in bench. Matte black fixtures provide a sharp contrast, complementing the dark framed glass enclosure and a warm wooden accent wall. Integrated warm LED strip lighting illuminates recessed storage niches, enhancing the spa-like ambiance and minimalist design with its sophisticated color palette.",
        "file_url": "/static/modern/images/bathroom_modern_72.jpg"
    },
    {
        "File Name": "bathroom_modern_75.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_75.jpg",
        "Style": "modern",
        "Generated Title": "Moody Contemporary Bathroom with Natural Elements",
        "Generated Description": "This sophisticated bathroom design blends industrial-chic aesthetics with natural warmth, featuring dominant dark charcoal grey large-format tiles on the walls and floor. Rich, warm-toned wood paneling on the ceiling and vanity countertop provides a striking contrast, while strategic lighting from recessed spotlights, under-shelf LED strips, and elegant pendant lights casts a soft, ambient glow that enhances the moody atmosphere. The overall design emphasizes clean lines, earthy colors, and a tranquil, spa-like ambiance, complete with sleek black vessel sinks and fixtures.",
        "file_url": "/static/modern/images/bathroom_modern_75.jpg"
    },
    {
        "File Name": "bathroom_modern_106.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_106.jpg",
        "Style": "modern",
        "Generated Title": "Elegant Grey Bathroom: Marble, Wood, and Ambient Glow",
        "Generated Description": "This elegant and modern bathroom showcases a sophisticated design using luxurious grey marble tiles on walls and floor, beautifully contrasted by a warm floating wood shelf and a light stone vanity top. Strategic lighting, including a prominent recessed ceiling panel, stylish globe pendants, and a backlit textured accent wall, creates a warm, inviting ambiance. The overall aesthetic is clean and contemporary, with minimalist white ceramic fixtures and a touch of gold from the faucet.",
        "file_url": "/static/modern/images/bathroom_modern_106.jpg"
    },
    {
        "File Name": "bathroom_modern_29.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_29.jpg",
        "Style": "modern",
        "Generated Title": "Modern Grey Marble Bathroom with Integrated Lighting",
        "Generated Description": "This sophisticated modern bathroom showcases a minimalist design with a predominantly monochromatic grey palette. Large format grey marble-look tiles adorn the walls and floor, creating a seamless and luxurious backdrop. Illumination is elegantly provided by vertical LED strips integrated into the frameless mirror, complemented by subtle recessed ceiling lights and a hidden LED strip beneath a wall niche, enhancing the serene ambiance. The space features a sleek dark grey floating vanity with a white vessel sink, black fixtures, and a touch of greenery, embodying a refined and contemporary aesthetic.",
        "file_url": "/static/modern/images/bathroom_modern_29.jpg"
    },
    {
        "File Name": "bathroom_modern_52.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_52.jpg",
        "Style": "modern",
        "Generated Title": "Warm Modern Bathroom with Earthy Textures and Lighting",
        "Generated Description": "This contemporary bathroom features a minimalist, spa-like design defined by earthy tones and rich textures. Walls are clad in large format mottled brown and bronze tiles, accented by a dark ribbed wooden panel, while the floating vanity and bowl sink are crafted from a sleek dark matte stone-look material. Strategic warm LED strip lighting under the vanity, within a recessed shelf, and along the floor perimeter, coupled with recessed ceiling spotlights, creates a luxurious, inviting ambiance and highlights the elegant, uncluttered design.",
        "file_url": "/static/modern/images/bathroom_modern_52.jpg"
    },
    {
        "File Name": "bathroom_modern_73.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_73.jpg",
        "Style": "modern",
        "Generated Title": "Sleek Bathroom Elegance: Stone, Wood, and Ambient Glow",
        "Generated Description": "This luxurious, modern bathroom vanity area showcases a sophisticated design featuring rich materials and integrated lighting. The walls are clad in large format stone tiles, with a dramatic veined brown-grey marble accentuating the back wall, complemented by lighter beige tones on the side walls. A floating dark wood vanity provides warmth beneath a light-colored, possibly concrete, countertop, while a large circular mirror with warm LED backlighting and two elegant pendant lights with illuminated rings create a radiant glow, enhancing the overall earthy color palette and contemporary aesthetic.",
        "file_url": "/static/modern/images/bathroom_modern_73.jpg"
    },
    {
        "File Name": "bathroom_modern_100.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_100.jpg",
        "Style": "modern",
        "Generated Title": "Sleek Modern Gray Bathroom with Warm Copper Accents",
        "Generated Description": "This contemporary bathroom showcases a sophisticated design, featuring a floating matte gray vanity with sleek cabinetry, dark fluted wall panels, and light marble flooring, elegantly accented by a polished copper sink and faucet. Warm ambient lighting emanates from vertical LED strips integrated into the wall panels, under-vanity illumination, and circular sconces, creating a luxurious and serene atmosphere.",
        "file_url": "/static/modern/images/bathroom_modern_100.jpg"
    },
    {
        "File Name": "bathroom_modern_60.jpg",
        "File Path": "c:\\Users\\Khushi\\OneDrive - University of Nebraska-Lincoln\\Desktop\\CornHacks\\design\\static\\modern\\images\\bathroom_modern_60.jpg",
        "Style": "modern",
        "Generated Title": "Chic Modern Bathroom: Greys, Black, and Greenery",
        "Generated Description": "This chic modern bathroom showcases a minimalist design through its sophisticated palette of light grey walls, dark grey/black tiling, and matte black fixtures for the shower and bath area. Natural light streams from a large skylight and is augmented by recessed ceiling lights, illuminating the crisp white sanitary ware, warm wooden shelves, and vibrant green plants that introduce a touch of biophilic calm to the sleek, functional space.",
        "file_url": "/static/modern/images/bathroom_modern_60.jpg"
    }
]